{
  "id": 7,
  "title": "Before The Big Apple: My Winding Path Here",
  "slug": "before-the-big-apple-my-winding-path",
  "excerpt": "Looking back at the unexpected journey that led me to New York and how a series of 'temporary' jobs became the foundation for a career in hospitality.",
  "content": "<p>Since a few of you have asked how I ended up in New York (and specifically, how I landed a job at The Luminous Grand with zero fancy credentials), here's the not-so-glamorous backstory.</p>\n\n      <p>The short version: I had no plan. Like, truly none.</p>\n\n      <p>The longer version: Dad's job in corporate sales meant we moved constantly. Six different high schools across four states kind of moving. By junior year, I was hopelessly behind in credits and tired of being the perpetual new girl, so I basically checked out. My grades nosedived, and college applications seemed pointless when we'd likely move again before I could even finish applying.</p>\n\n      <p>Mom says my \"gypsy soul\" comes from all that moving. Probably true. I've never been good at staying in one place for long. Not exactly my finest quality, I know, but I've made peace with it.</p>\n\n      <p>So I dropped out. Not my proudest moment, but honestly? It felt right at the time. Got my GED three months later and started picking up shifts at coffee shops and diners - places that cared more about whether you showed up on time than your educational background.</p>\n\n      <p>When I was 19, Dad got transferred again - this time to a small town in Oregon with exactly one decent coffee shop (which thankfully hired me). The owner, Maggie, had worked in restaurants across Europe before settling down. She taught me everything about proper espresso, bean origins, and how to memorize complex orders without writing anything down.</p>\n\n      <p>A local wine shop started hosting tastings that I'd attend after my shifts. The owner noticed my genuine interest and offered me weekend work. Didn't pay much, but I got to taste everything we opened for customers (for \"educational purposes\") and learn what makes Oregon Pinots different from California ones. Looking back, this was the beginning of my wine obsession.</p>\n\n      <p>My unexpected talent back then was finding amazing vintage clothes. When you move frequently without much money, you develop an eye for thrift shopping. I could spot designer pieces that just needed minor repairs. My roommate Jess was always borrowing my finds and eventually asked me to help style her for her cousin's wedding.</p>\n\n      <p>That wedding changed everything. The bride was impressed with Jess's outfit and asked who her \"stylist\" was. When Jess pointed to me, I suddenly found myself helping with last-minute wedding details. Turns out I had a knack for crisis management (calming a melting-down flower girl, solving catering mishaps). The wedding coordinator noticed and offered me occasional work with her company.</p>\n\n      <p>For the next year, I juggled morning coffee shop shifts, weekend wine shop hours, and wedding gigs whenever possible. Exhausting but fulfilling - the first time I felt like I was developing genuine skills despite my unconventional path.</p>\n\n      <p>When Dad's company transferred him again, I decided to stay behind. At 21, with some savings and growing confidence, I moved to Portland, then Seattle, working various hospitality jobs and building a resume that started to make some sense.</p>\n\n      <p>The turning point came when a bride from a Seattle wedding (who happened to be a manager at a luxury New York hotel) mentioned they were looking for people with \"fresh perspectives\" in their events department. She suggested I apply. I thought it was ridiculous - me, with no degree and a hodgepodge of service jobs, working at a prestigious New York hotel?</p>\n\n      <p>But I applied anyway. Spent days crafting a cover letter explaining how my diverse experiences had given me exactly the right skills for the position. Used my savings to fly to New York for the interview. And somehow... I got it.</p>\n\n      <p>That was two years ago. The events role eventually led to my current position, which still feels surreal some days.</p>\n\n      <p>So there's the truth. No impressive degree, no five-year plan - just a series of jobs I took because I needed income, which unexpectedly became the foundation for a career I love. Dad still occasionally suggests I \"get serious\" and finish college. Maybe someday, but for now, this winding path seems to be working out just fine.</p>\n\n      <p>Coming soon: the full story of my first day at The Luminous Grand, including the infamous champagne tray incident my colleagues STILL won't let me forget.</p>",
  "coverImage": "/images/blog/2017_08_15-before-the-big-apple-my-winding-path.jpg",
  "publishedAt": "2017-08-15T10:00:00Z",
  "category": "Personal",
  "location": "New York",
  "featured": 0,
  "readTime": 5,
  "prevPostId": null,
  "nextPostId": null
}