{
  "id": 7,
  "title": "Before The Big Apple: My Winding Path Here (Timeline)",
  "slug": "before-the-big-apple-my-winding-path",
  "excerpt": "Looking back at the unexpected journey that led me to New York and how a series of 'temporary' jobs became the foundation for a career in hospitality.",
  "content": "<p>Since a bunch of you have been asking how I ended up in New York (and specifically, how I landed a job at The Luminous Grand with zero fancy credentials), I thought I'd finally share the not-so-glamorous backstory.</p>\n\n      <p>The short version: I had no plan. Like, truely none.</p>\n\n      <p>The longer version: Dad's job in corporate sales meant we moved. A lot. Six different high schools across four states kind of a lot. By junior year, I was so behind in credits and so tired of being the perpetual new girl that I basically checked out. My grades tanked, and college applications seemed pointless when we'd probably move again before I could even finish applying.</p>\n\n      <p>Mom says my \"gypsy soul\" comes from all that moving. She's probably right. I've never been good at staying in one place or with one person for too long. There was Jake in high school - my first real boyfriend who got all wierd and possessive when Dad's transfer came through and I didn't shed enough tears about leaving. Then there was Eric during my Seattle days, who started dropping hints about \"our future apartment\" after just four months. I broke it off the next day. Two perfectly nice guys, but the minute things start feeling too settled, I get this itch to run. Not exactly my finest quality, I know.</p>\n\n      <p>So I dropped out. Not my proudest moment, but honestly? It felt like freedom. Got my GED three months later and started picking up shifts at local diners and coffee shops – the kind of jobs where they don't care about your transcript, just whether you can show up on time and not spill coffee on customers (a skill I had to develop through painful trial and error).</p>\n\n      <p>Dad got transferred again when I was 19 – this time to this tiny town in Oregon with exactly one decent coffee shop, which thankfully hired me. The owner, Maggie, was this incredible woman who'd worked in restaurants all over Europe before settling down to raise her kids. She taught me everything about proper espresso, why bean origin matters, and how to remember complex orders without writing anything down.</p>\n\n      <p>When a local wine shop started hosting tastings, I'd go after my shifts just for something to do. The owner noticed I kept coming back and actually asking questions, so he offered me a weekend job. Didn't pay much, but I got to taste everything we opened for customers (\"for educational purposes\") and learn why Oregon Pinots are different from California ones. Looking back, this was probably where my wine obsession began.</p>\n\n      <p>My one real skill in those days was finding amazing second-hand clothes. When you move constantly and don't have much money, you get good at thrift shopping out of necessity. I'd find designer pieces for a few bucks that just needed minor repairs or alterations. My roommate Jess was constantly borrowing my stuff, and eventually asked me to help style her for her cousin's wedding.</p>\n\n      <p>That cousin's wedding changed everything. The bride loved Jess's outfit so much that she asked who her \"stylist\" was. Jess pointed to me, and suddenly I was helping with last-minute details for the wedding. Turned out I had a knack for solving crisis situations (like when the flower girl had a meltdown or when the caterer arrived with the wrong appetizers). The wedding coordinator noticed and offered me occasional gig work with her company.</p>\n\n      <p>For the next year, I juggled the coffee shop in the mornings, wine shop on weekends, and wedding gigs whenever they came up. It was exhausting but also the first time I felt like I was actually developing real skills, even without a conventional education.</p>\n\n      <p>When Dad got transferred again (shocker), I decided not to follow this time. I was 21, had saved up a bit, and figured I'd try a bigger city where I could find more work in events or hospitality. Picked Portland first, then Seattle, working various service jobs and slowly building up a résumé that didn't look completely pathetic.</p>\n\n      <p>Then came the turning point: one of the brides I'd worked with at a Seattle wedding was a manager at a luxury hotel in New York. She said they were looking for people with \"fresh perspectives\" in their events department and suggested I apply. I thought it was a joke – me, with no degree, no connections, and a random assortment of service jobs, working at a fancy New York hotel?</p>\n\n      <p>But I applied anyway. Spent three days crafting a cover letter explaining how all my random jobs had actually given me exactly the right skills for the position. Used my last bit of savings to fly to New York for the interview. And somehow... I got it.</p>\n\n      <p>That was two years ago. The events coordination job eventually led to my current position, which still feels surreal some days.</p>\n\n      <p>So that's the unglamorous truth. No impressive degree, no five-year plan, just a series of jobs I took because I needed money and then accidentally discovered I was good at them. Dad still thinks I'll \"get serious\" and go back to school eventually. Maybe I will someday, but for now, this winding path seems to be working out okay.</p>\n\n      <p>Next week: the full embarrassing story of my first day at The Luminous Grand, including the infamous champagne tray incident my coworkers STILL won't let me forget.</p>",
  "coverImage": "/images/blog/2017_08_15-before-the-big-apple-my-winding-path.jpg",
  "publishedAt": "2017-08-15T10:00:00Z",
  "category": "Personal",
  "location": "New York",
  "featured": 0,
  "readTime": 5,
  "prevPostId": null,
  "nextPostId": null
}