{
  "id": 12,
  "title": "Summer Cocktails: Manhattan's Hidden Speakeasies",
  "slug": "summer-cocktails-manhattan-speakeasies",
  "excerpt": "Exploring New York's secretive cocktail culture and how these intimate spaces have influenced my approach to hospitality and ambiance.",
  "content": "<p>There's something magical about NYC's speakeasy scene. The secret entrances behind phone booths and bookshelves, the hushed passwords, feeling like you've stepped back in time... it's WAY more than just getting a fancy cocktail.</p>\n      <p>Working in hospitality has made me obsessed with how these tiny hidden bars create such incredible vibes. The dim lighting that makes everyone look gorgeous, the perfectly curated music that's never too loud for conversation, watching bartenders treat mixing drinks like a religious ceremony—all of it creates this amazing experience.</p>\n      <p>Last weekend, Mia (coworker from the bridal salon) and I went speakeasy-hopping downtown. Started at Please Don't Tell (the one behind the phone booth) where I had this incredible gin cocktail with cucumber and some kinda spicy honey situation that I'm still thinking about. The bartender did this whole fire element with a twisted orange peel that honestly felt like watching magic.</p>\n      <p>Next we found this unmarked door on Avenue A that I've walked past a million times with zero clue it was there. Tiny staircase down to this basement jazz bar with maybe 20 seats tops. The cocktail menu was INSANE - drinks with ingredients I'd never heard of (what even is \"orgeat\" or \"falernum\"??). Got something called a Paper Plane that basically changed my life. The bartender spent forever making it, carefully measuring everything with these tiny jiggers. Made me realize how rushed and sloppy most regular bar service is.</p>\n      <img src=\"/images/blog/2019_07_08-summer-cocktails-manhattan-speakeasies_img02.jpg\" alt=\"A bartender creating a craft cocktail with smoke elements\" class=\"my-6 w-full rounded-lg shadow-md\" />\n      <p>What's stuck with me most is how intentional everything feels in these spaces. Nothing's random - from the vintage glassware to the perfect ice cubes to the fact that the bartenders all seem to have advanced degrees in mixology. Makes me think about what we could bring into wedding design - that sense of thoughtful details and unexpected moments.</p>\n      <p>Also learned I've been making Moscow Mules completely wrong my entire life? Apparently you need to \"express\" the lime oils over the drink before dropping it in. Who knew?? Also copper mugs aren't just for looks - they actually keep the drink colder. Mind blown.</p>\n      <p>Ended our night at this tiny Japanese whiskey bar where they hand-carve ice into perfect spheres for each drink. The precision was hypnotic - took like 5 mins per ice ball but totally worth it. Tried Japanese whisky for the first time and now I'm obsessed. Definitely can't afford to make it a habit tho - $32 for ONE DRINK is insane, even by Manhattan standards.</p>\n      <p>Think I'm going to try recreating some of these cocktails for our next salon staff party. Already ordered proper mixing glasses and fancy ice molds online after too many cocktails (drunk online shopping strikes again). My studio apartment kitchen is WAY too small for proper bartending but determined to make it work!</p>",
  "coverImage": "/images/blog/2019_07_08-summer-cocktails-manhattan-speakeasies.jpg",
  "publishedAt": "2019-07-08T10:00:00Z",
  "category": "Hospitality",
  "location": "New York",
  "featured": 0,
  "readTime": 4,
  "prevPostId": null,
  "nextPostId": null
}