{
  "id": 16,
  "title": "Big News: I'm Moving to Sydney! (Update02)",
  "slug": "new-chapter-moving-sydney",
  "excerpt": "The exciting decision to relocate to Australia, the opportunities that await, and mixed emotions about leaving New York behind.",
  "content": "<p>I just accepted a job in Sydney! After working at The Luminous for these past couple years, I'm making a leap to Australia. Still can't quite believe it.</p>\n\n      <p>It happened so unexpectedly. Remember that Australian hotel manager who stayed with us in October? Sarah from Harbour House? We got talking during check-in about my background in events and hospitality. What started as simple concierge small talk turned into a longer conversation about the differences between American and Australian hospitality approaches.</p>\n\n      <p>She mentioned they were opening a new boutique hotel in Sydney and needed someone to help with their events program. \"We're looking for someone who understands hospitality but brings a different perspective,\" she said. I laughed and told her I wasn't exactly an international expert, but we kept in touch.</p>\n\n      <img src=\"/images/blog/2020_01_20-new-chapter-moving-sydney_img02.jpg\" alt=\"My visa paperwork and one-way ticket to Sydney\" class=\"my-6 w-full rounded-lg shadow-md\" />\n\n      <p>After a few video calls (and one very nervous presentation of event ideas I'd prepared), they offered me the job: Events Coordinator at their new Sydney location. I'll be organizing their special events calendar, helping with some local food and wine partnerships, and putting together packages for visitors. They're even interested in expanding into small weddings, which is perfect given my background.</p>\n\n      <p>The pay is decent - about the same as New York when you factor in the exchange rate - but they're providing housing for the first month, and the hours are much more reasonable than hotel work. Plus, they're going to send me on some local tours during my first month to help me get to know Sydney's food and cultural scene. Paid tourism? Yes please!</p>\n\n      <p>I've been researching Sydney like crazy. It seems like such a food-focused city, with all these amazing markets and restaurants. They apparently take their coffee very seriously too (which you know is important to me). And the whole indoor-outdoor lifestyle sounds incredible after New York winters.</p>\n\n      <p>One thing I'm excited about is that the hotel is near some of Australia's wine regions. I don't know much about wine, but Sarah mentioned staff sometimes get to visit vineyards to learn about local products they serve. I've always wanted to learn more about wine beyond the basics I picked up at that Oregon shop years ago.</p>\n\n      <p>Australian food culture is apparently very focused on local, seasonal ingredients, which fits perfectly with my interest in sustainable hospitality. Sarah mentioned they're developing relationships with local producers, and I might get to help coordinate some of those partnerships too.</p>\n\n      <p>My boss at The Luminous was surprised when I gave notice - \"You're leaving Manhattan for Australia?\" But I think this is exactly what I need right now. A complete change of scenery, new challenges, and the chance to be part of something from the beginning rather than joining an established operation.</p>\n\n      <p>First projects when I arrive: helping organize their opening events and getting to know the neighborhood. Sydney is apparently divided into these distinct areas, each with their own character. The hotel is in Surry Hills, which Sarah describes as \"artsy but grown-up\" - whatever that means!</p>\n\n      <p>Flight leaves in ten days. I keep panic-watching travel videos about Sydney and trying to learn Australian slang. What exactly is a \"fair dinkum\"? Guess I'll find out soon!</p>",
  "coverImage": "/images/blog/2020_01_20-new-chapter-moving-sydney.jpg",
  "publishedAt": "2020-01-20T10:00:00Z",
  "category": "Personal",
  "location": "New York",
  "featured": 0,
  "readTime": 4,
  "prevPostId": null,
  "nextPostId": null
}