{
  "id": 15,
  "title": "New Beginnings: When Distance is the Only Answer",
  "slug": "new-beginnings-distance-needed",
  "excerpt": "Sometimes the bravest decision is to leave everything familiar behind. A reflection on new chapters and the courage to start over.",
  "content": "<p>So. I'm leaving New York. Like, for real leaving.</p>\n\n      <p>Wasn't the plan (definitely not this soon), but sometimes life decides for you, right?</p>\n\n      <p>Not dumping all the messy details here. Short version: staying in NYC suddenly feels impossible. Can't breathe when I think about staying another month.</p>\n      \n      <p>Australia. AUSTRALIA! Literally opposite side of the planet, which feels exactly right. Jen (from culinary school) connected me with this hotel job in Sydney and I said yes before the interview even finished.</p>\n\n      <p>Mom's convinced I'm \"running away from my problems\" (her exact words last call). Dad says I'm being brave and adventurous. Maybe both? The line between escape and adventure has always been blurry for me.</p>\n\n      <img src=\"/images/blog/2020_01_10-new-beginnings-distance-needed_img02.jpg\" alt=\"An empty suitcase waiting to be packed for a new life in Australia\" class=\"my-6 w-full rounded-lg shadow-md\" />\n\n      <p>Start new job in 3 weeks. Signed sublease yesterday. Most stuff sold/donated - my entire life fits in six suitcases. Crazy how fast you can tear down everything.</p>\n\n      <p>Sarah asked if I'm scared. Weirdly no. That's the strangest part. All I feel is massive RELIEF. Can finally breathe again. Maybe terror hits mid-flight... we'll see!</p>\n\n      <p>Australia. Beaches, sunshine, and nobody knows anything about me. No expectations or histories or...complications. Just me and whatever version of myself I want to be.</p>\n\n      <p>Flying Tuesday. Last post for a bit - apparently my Sydney place has no WiFi (how's that still a thing in 2020??), but taking it as a sign to disconnect from everything here.</p>\n\n      <p>So here's to completely insane life decisions! Here's to running towards something not away (at least that's what I'm telling myself). Here's to finding what else exists beyond this concrete jungle I've called home.</p>",
  "coverImage": "/images/blog/2020_01_10-new-beginnings-distance-needed.jpg",
  "publishedAt": "2020-01-10T10:00:00Z",
  "category": "Personal",
  "location": "New York",
  "featured": 0,
  "readTime": 3,
  "prevPostId": null,
  "nextPostId": null
}