{
  "id": 18,
  "title": "Hunter Valley Vineyards: A Wine Education (Update02)",
  "slug": "hunter-valley-vineyards-wine-education",
  "excerpt": "Exploring Australia's oldest wine region and discovering how terroir translates into taste through immersive vineyard experiences.",
  "content": "<p>So I finally made it to the famous Hunter Valley wine region this weekend. Full disclosure: Despite my old weekend gig at that Oregon wine shop years ago, I went there feeling like a total novice when it comes to Australian wines. My basic knowledge of American Pinots doesn't exactly translate here. My Uber driver found my confusion about Australian varietals hysterical and spent the 40-minute ride calling me a 'typical American.' Whatever, mate.</p>\n\n      <p>The first vineyard we visited was this super fancy place with a gravel driveway longer than some NYC blocks. Was feeling pretty intimidated until I met our host, Dave, this 60-something guy with a wild gray beard and hands that looked like tree bark. No pretension whatsoever. When I admitted I couldn't tell the difference between a Shiraz and a Cab Sav (Australian wines are a whole new world compared to the Oregon Pinots I used to know something about), he just laughed and said, \"Perfect, blank slate!\" instead of the wine-snob judgment I was expecting.</p>\n\n      <p>The whole 'tasting' thing was overwhelming at first. Everyone around me was swirling and sniffing and talking about 'notes of blackberry and tobacco' while I was just trying not to spill on my white shirt. Made the rookie mistake of actually drinking each sample instead of spitting it out... by the third vineyard I was definitely feeling it. Ended up buying two bottles from the second place that I'm not convinced I actually liked, but the sommelier was really cute and I got flustered. Typical.</p>\n\n      <img src=\"/images/blog/2020_08_14-hunter-valley-vineyards-wine-education_img02.jpg\" alt=\"Margaret pouring Semillon straight from the tank at her family vineyard\" class=\"my-6 w-full rounded-lg shadow-md\" />\n\n      <p>Best part of the day wasn't even planned. Our driver took a wrong turn (blame the windy roads, not the wine), and we ended up at this tiny family-owned place that wasn't on our itinerary. The owner, Margaret, was this no-nonsense woman who told us her grandkids made the labels. She poured us their Semillon straight from a tank rather than a bottle and explained that they'd had a terrible harvest that year because of the bushfires. The smoke had affected the grapes, she said, but she was still going to make wine from them and call it their 'Resilience Vintage.' That glass, sitting on a weathered picnic table with her three-legged dog snoring at my feet, tasted better than anything at the fancy estates.</p>\n\n      <p>Michael came along on this trip too – he's become a regular feature in my Australian adventures since that first Northern Beaches tour back in March. We have this easy friendship that feels comfortable, though I keep waiting for the other shoe to drop. It's nice having someone to learn alongside though. He's equally clueless about wine despite being Australian and claims his wine knowledge consists entirely of \"red or white\" and \"under $20.\" His summation of each tasting was \"Yeah, I'd drink that\" or \"Nah, pass\" – much to the horror of a very serious couple next to us who were making extensive notes on their phones.</p>\n\n      <p>Something about vineyards makes you get philosophical (or maybe that was just the wine talking). Walking between these rows of vines that have been there for decades, producing fruit season after season regardless of what's happening in the wider world – it gives you this perspective on your own small problems. I was telling Margaret about my pandemic job uncertainty, and she just pointed to some gnarled old vines and said they'd survived drought, fire, flood, and now smoke damage. \"You'll be right, love,\" she said in that matter-of-fact Aussie way. \"Just need deep roots and the ability to adapt.\"</p>\n\n      <p>Learned that Semillon is the Hunter Valley's signature white grape (not that I could identify it in a lineup), and that Australia's wine regions are way more diverse than I ever realized. The Hunter makes different styles than the Barossa which makes different wines than Margaret River – it's as varied as the difference between Napa and the Willamette Valley. Makes me want to explore more wine regions while I'm here, COVID permitting. Michael's already talking about a trip to the Barossa Valley in South Australia once borders reopen, which might be nice to look forward to.</p>\n\n      <p>One of the most interesting parts was learning how climate change is affecting their harvests. The winemaker at our last stop (after I'd sobered up enough to actually retain information) explained that they're harvesting earlier each year, and the alcohol content in their wines has been creeping up due to warmer temperatures. They're having to adapt everything from grape varieties to trellis design. Yet another reminder that what's in your glass is directly connected to the environment around it.</p>\n\n      <p>Got home with a splitting headache, sunburned shoulders (note to self: Australian sun is NOT like New York sun), and a new appreciation for how much work goes into each bottle. Still can't tell you much about tannins or terroir, but I did learn that good wine is more about the stories and the people than the price tag. And also that you should definitely eat something substantial before a wine tour. Rookie error.</p>\n\n      <p>The crowning achievement of my Hunter Valley education? I can now pronounce Semillon correctly, and I've finally found a word that rhymes with my last name. Small victories!</p>",
  "coverImage": "/images/blog/2020_08_14-hunter-valley-vineyards-wine-education.jpg",
  "publishedAt": "2020-08-14T10:00:00Z",
  "category": "Travel",
  "location": "Australia",
  "featured": 0,
  "readTime": 4,
  "prevPostId": null,
  "nextPostId": null
}