{
  "id": 17,
  "title": "Working Through a Pandemic: Hospitality in Uncertain Times (Update02)",
  "slug": "pandemic-hospitality-uncertain-times",
  "excerpt": "Reflections on adapting to COVID-19 challenges in the luxury hotel industry and finding meaningful ways to serve during global disruption.",
  "content": "<p>Day freaking 94 of this COVID nightmare. I know I should be grateful to still have a job when half our staff's been let go, but UGH working in an empty hotel is creepy AF. The Harbour View has 312 rooms and we have exactly 8 guests rn. EIGHT!!! All either stranded travelers who can't get flights home or businesspeople doing mandatory quarantine. Our massive lobby that used to buzz with energy now echoes like a horror movie whenever anyone walks through.</p>\n\n      <p>Four kitchen staff tested positive last week 😷 Management tried to keep it quiet (shocker) but obvs word spread. Now everyone's paranoid, giving death stares if someone so much as clears their throat. We're in masks 24/7 which is giving me this gross acne all along my jawline - super attractive. Plus the masks hide our expressions which makes it impossible to do that warm, personal service thing that's literally MY ENTIRE JOB.</p>\n\n      <img src=\"/images/blog/2020_06_18-pandemic-hospitality-uncertain-times_img02.jpg\" alt=\"The eerily empty luxury hotel lobby with sanitization stations\" class=\"my-6 w-full rounded-lg shadow-md\" />\n\n      <p>FaceTimed the parents yesterday and completely lost it crying. This big Australia move was supposed to be this amazing adventure, and now I'm basically trapped in pandemic purgatory. Can't go home bc of travel restrictions, can't explore my new country bc everything's closed or limited. Mom tried cheering me up with \"at least you're somewhere warm during all this\" which just made me feel like a whiny brat for complaining when people are literally dying.</p>\n\n      <p>Silver lining: those of us still employed have gotten super tight. We're like this weird little pandemic family now. Raj from engineering taught me cricket in the empty ballroom after our shifts yesterday (def against some rule but who's gonna complain?). And Mel from reception's been teaching me proper Aussie slang - apparently I've been saying Melbourne completely wrong this whole time (it's \"MEL-bin\" not \"MEL-BORN\" who knew??)</p>\n\n      <p>Started these ridiculous traditions to keep from losing our minds. Every Friday after evening shift, whoever's working meets in the staff room for what we call \"Fancy Apocalypse\" - we raid the unused mini bar stock (management finally gave in) and dress up in whatever random stuff we can find. Last week I wore a tablecloth as a cape and Raj made this crown out of folded room service menus. Completely stupid and childish but gives us something to actually look forward to.</p>\n\n      <p>The strangest thing is how we've had to totally reimagine what \"luxury service\" even means anymore. Used to be about anticipating needs, getting physically close to help guests, creating elaborate experiences. Now it's literally just about making people feel SAFE. We're legit marketing our cleaning protocols as a luxury amenity. \"Enjoy our hospital-grade disinfection process!\" Never in a million years thought I'd be proudly showing off our UV sanitizing equipment to guests like it was some fancy feature.</p>\n\n      <p>Got in this heated debate with Michael yesterday about whether this changes hospitality forever or if everything just bounces back once there's a vaccine. He thinks we'll go right back to normal - in-room dining, turndown service, packed hotel bars. I'm not buying it. Something feels permanently different in how people think about shared spaces now, about what feels safe vs what feels luxurious. Maybe it's just my New York paranoia but I literally cannot imagine ever looking at a hotel buffet the same way again. Like...communal tongs?? HARD PASS.</p>\n\n      <p>Been trying to get creative with making isolation less depressing. Created these \"Quarantine Concierge\" packages for our few guests - curated movie nights with themed snacks, virtual wine tastings where we leave bottles outside their door and Zoom for guidance, even custom in-room workouts. Kinda creatively satisfying tbh. Never thought my hospitality career would involve teaching a 60-year-old CEO how to do yoga via FaceTime from across the hall, but 2020 is nothing if not ~surprising~.</p>\n\n      <p>Management keeps insisting things will bounce back but idk. Some days I seriously consider just giving up and trying to get home (if they'd even let me in), but then I remember the job market there is probably 10x worse. So here I am, wearing my fancy uniform to serve literally 8 people and obsessively disinfect surfaces nobody's touched. What a time to be in luxury hospitality!!</p>\n\n      <p>Just found out our sister property is closing permanently - the historic Bronton Hotel that's been around since 1887, survived TWO WORLD WARS and the Great Depression, couldn't survive COVID. Makes me wonder what other casualties this nightmare will claim before it's over. Every industry will have its horror stories I guess, but hospitality feels especially screwed. Our entire existence is based on human connection and being together. What happens when that becomes the actual thing people fear most? Still processing that existential crisis, will get back to you...</p>",
  "coverImage": "/images/blog/2020_06_18-pandemic-hospitality-uncertain-times.jpg",
  "publishedAt": "2020-06-18T10:00:00Z",
  "category": "Hospitality",
  "location": "Australia",
  "featured": 0,
  "readTime": 6,
  "prevPostId": null,
  "nextPostId": null
}