{
  "id": 16,
  "title": "Sydney Calling: A Hospitality Adventure Down Under (Update02)",
  "slug": "new-chapter-moving-sydney",
  "excerpt": "The exciting decision to relocate to Australia, the opportunities that await, and mixed emotions about leaving New York behind.",
  "content": "<p>I just accepted a job in Sydney! After working at The Luminous for these past couple years, I'm making a leap to Australia. Still can't quite believe it.</p>\n\n      <p>It happened so unexpectedly. Remember that Australian wine distributor who stayed with us in October? Kate from Hunter Valley Wines? We got talking during one of our wine tastings when I mentioned my weekend job at that Oregon wine shop years ago. Turns out she was impressed with how I described the differences between Willamette Valley and Burgundy Pinots (thank you, wine education classes!).</p>\n\n      <p>She mentioned they were opening a new tasting room in Sydney with a restaurant attached, and needed someone who understood both hospitality and wines to help coordinate events. \"We're looking for someone who gets the hospitality side but also speaks wine language,\" she said. I laughed and told her I was hardly a sommelier, just enthusiastic. But we kept in touch.</p>\n\n      <img src=\"/images/blog/2020_01_20-new-chapter-moving-sydney_img02.jpg\" alt=\"My visa paperwork and one-way ticket to Sydney\" class=\"my-6 w-full rounded-lg shadow-md\" />\n\n      <p>After a few video calls (and one very nervous wine tasting where I had to describe Australian wines I'd never tried before), they offered me the job: Events Coordinator at their new Sydney location. I'll be running wine tastings, coordinating with local restaurants for food pairings, and helping develop their events schedule. They're even letting me create a wedding package for the vineyard, which is perfect given my background.</p>\n\n      <p>The pay is decent - about the same as New York when you factor in the exchange rate - but they're providing housing for the first month, and the hours are much more reasonable than hotel work. Plus, they're flying me to the actual Hunter Valley vineyards for a two-week training session once I arrive. Paid wine education in Australian wine country? Yes please!</p>\n\n      <p>I've been researching Australian wines like crazy. Did you know they're known for Shiraz instead of Syrah? Same grape, different name. And there's this white wine called Semillon that's apparently Hunter Valley's specialty. I've been trying to find bottles here in New York to practice, but Australian imports are surprisingly hard to come by.</p>\n\n      <p>I'm most excited about learning a completely different wine landscape. Kate told me that Australian wine regions are as diverse as American ones, with different climates producing totally different styles. The Hunter Valley gets more rainfall than other regions, so their wines have this unique character. I've been reading books and watching YouTube videos to prepare, but I know the real education will come once I'm there.</p>\n\n      <p>I'll also be helping with some of their farm-to-table concepts. Australian food culture is apparently very focused on local, seasonal ingredients, which fits perfectly with my interest in sustainable hospitality. Kate mentioned they're developing relationships with local cheese producers and farms, which will be part of my job too.</p>\n\n      <p>My boss at The Luminous was confused when I gave notice - \"You're leaving New York to pour wine in Australia?\" But she doesn't get that this is exactly the direction I've been trying to move toward. Hotels are great, but food and wine experiences are where my heart is. And the chance to be part of a new venture from the beginning is too good to pass up.</p>\n\n      <p>First projects when I arrive: helping design a seasonal tasting menu for autumn (which is actually March-May in Australia - so weird!) and setting up their wedding consultation service. I've already started designing some Australian-inspired cheese and wine pairings based on what I can research from here.</p>\n\n      <p>Flight leaves in ten days. I keep panic-ordering books on Australian wine regions. Sydney, I hope you're ready for an enthusiastic wine amateur with too many event ideas!</p>",
  "coverImage": "/images/blog/2020_01_20-new-chapter-moving-sydney.jpg",
  "publishedAt": "2020-01-20T10:00:00Z",
  "category": "Personal",
  "location": "New York",
  "featured": 0,
  "readTime": 4,
  "prevPostId": null,
  "nextPostId": null
}