{
  "id": 16,
  "title": "Big News: I'm Moving to Sydney!",
  "slug": "new-chapter-moving-sydney",
  "excerpt": "The exciting decision to relocate to Australia, the opportunities that await, and mixed emotions about leaving New York behind.",
  "content": "<p>OMG I ACCEPTED A JOB IN SYDNEY!! After 2 years at The Luminous, I'm literally moving to AUSTRALIA. Still having moments where I think I might be having a very elaborate dream.</p>\n\n      <p>The whole thing happened in the most random way possible. Remember that Australian hotel manager who stayed with us back in October? Sarah from Harbour House? We started chatting during check-in about my events background and somehow ended up in this super long convo about American vs Australian hospitality styles. Total checkout line friendship that should've ended when she left.</p>\n\n      <p>But then she mentioned they were opening this boutique hotel in Sydney and needed someone for their events program. Her exact words: \"We want someone who gets hospitality but isn't stuck in the Australian way of doing things.\" I laughed and was like \"I'm definitely not an international expert\" but we kept in touch via email.</p>\n\n      <img src=\"/images/blog/2020_01_20-new-chapter-moving-sydney_img02.jpg\" alt=\"My visa paperwork and one-way ticket to Sydney\" class=\"my-6 w-full rounded-lg shadow-md\" />\n\n      <p>Fast forward through some awkward Zoom interviews (time zones are BRUTAL) and one extremely stressed-out presentation where I pitched a bunch of event ideas, they offered me the job!! I'll be their Events Coordinator, handling their special events calendar, building partnerships with local food/wine places, and creating visitor packages. They even want to start doing small weddings, which is perfect with my bridal salon experience!</p>\n\n      <p>The $$ situation isn't too bad - basically the same as NY once you do the currency math - but they're covering housing for the first month (!!!) and the hours are wayyy better than hotel life. PLUS they're sending me on local tours during my first month so I can get to know Sydney. Getting paid to be a tourist?? Is this real life??</p>\n\n      <p>Been down the Sydney research rabbit hole HARD. Seems like such a food-obsessed city with these incredible markets and restaurants everywhere. Apparently they're super serious about coffee (which you KNOW is important to me and my borderline unhealthy caffeine addiction). And the whole beach lifestyle thing sounds amazing after freezing my butt off in NY winters.</p>\n\n      <p>Super excited that the hotel is close to some wine regions. I know basically nothing about wine except the little bits I picked up at that Oregon shop years ago. Sarah mentioned they sometimes send staff on vineyard tours to learn about the local wines they serve. Um, yes please?</p>\n\n      <p>Australian food is apparently super focused on local, seasonal stuff, which fits perfectly with my whole sustainable hospitality obsession. Sarah said they're building relationships with local farmers/producers and I might get to help coordinate those partnerships too!</p>\n\n      <p>When I told my boss at The Luminous I was leaving, his face was PRICELESS. \"You're leaving Manhattan... for Australia?\" like I said I was moving to Mars. But honestly this feels exactly right. Complete change of everything, new challenges, and actually getting to help BUILD something from scratch instead of just maintaining someone else's vision.</p>\n\n      <p>First things on my Sydney to-do list: helping plan their opening events and exploring the neighborhood. Sydney has all these distinct areas with totally different vibes. The hotel's in Surry Hills, which Sarah described as \"artsy but grown-up\" whatever that means! Gonna find out I guess!</p>\n\n      <p>Flight's in 10 days. Currently panic-watching Sydney travel videos at 2am and attempting to learn Australian slang from YouTube. What the heck is a \"fair dinkum\"?? And why do they call flip-flops \"thongs\"?? So much to learn... but honestly can't wait!!!</p>",
  "coverImage": "/images/blog/2020_01_20-new-chapter-moving-sydney.jpg",
  "publishedAt": "2020-01-20T10:00:00Z",
  "category": "Personal",
  "location": "New York",
  "featured": 0,
  "readTime": 4,
  "prevPostId": null,
  "nextPostId": null
}