{
  "id": 16,
  "title": "Sydney First Impressions: Ocean, Light, and Lifestyle (Updated)",
  "slug": "sydney-first-impressions",
  "excerpt": "The surprising elements of Australian life that have captured my imagination and how the quality of light changes everything.",
  "content": "<p>Week two in Sydney and I'm still jet-lagged as hell. Woke up at 4 AM again today and decided to walk to the harbor to watch the sunrise. Turns out this was accidentally brilliant because the light here is INSANE. Like, I've heard photographers talk about \"quality of light\" before and always thought it was pretentious BS, but they weren't kidding about Sydney. Everything glows differently. The Opera House literally changes colors throughout the day. Maybe it's the cleaner air or being surrounded by water, but it makes even my crappy phone photos look semi-professional.</p>\n\n      <p>Been comparing everything to New York and annoying myself doing it. The trains are cleaner. The coffee is better (seriously, what is this \"flat white\" magic?). People actually smile at strangers. But I miss the pizza terribly – had something claiming to be a New York slice yesterday that was an absolute travesty. Also can't get used to people driving on the left side. Nearly got flattened twice today looking the wrong way before crossing.</p>\n\n      <p>The apartment I rented online is... not exactly as advertised. The \"harbor view\" requires hanging halfway out the bathroom window and craning your neck to the right. And apparently \"cozy\" is Australian for \"so small you have to step into the hallway to change your mind.\" But the location is perfect and my neighbors seem nice, though I can't understand half of what they're saying. The Aussie accent gets thicker when they're being friendly, which is both charming and completely incomprehensible.</p>\n\n      <p>Weirdest observation so far: business attire here is bizarrely casual compared to NYC. My new boss showed up to our first meeting in shorts and flip-flops (sorry, \"thongs\" – learned quickly that's what they call them here, which led to an awkward misunderstanding). He had just come from a morning swim and had salt on his shirt collar. In New York, this would be career suicide, but here it's just... Tuesday. When I overdressed for my second day at work, one of my colleagues actually asked if I had a job interview afterward.</p>\n\n      <p>Starting to wonder if I overpacked. Half my wardrobe feels too formal, too dark, too... New York. Might need to do some shopping this weekend if I want to blend in better. The locals seem to have mastered this effortless, beachy elegance that I'm completely failing at so far. Tried to recreate the \"just came from the beach\" look this morning but ended up looking like I'd been caught in a rainstorm instead.</p>\n\n      <p>Still, despite the jet lag and the culture shock, I catch myself grinning like an idiot at random moments. There's something magical about starting completely fresh in a place where nobody knows you. I walked along Bondi Beach yesterday evening and had this moment of total clarity – this was absolutely the right decision, even if I still can't figure out the coins here (seriously, why is the 5 cent piece bigger than the 10 cent piece?!).</p>",
  "coverImage": "/images/blog/2020_03_10-sydney-first-impressions.jpg",
  "publishedAt": "2020-03-10T10:00:00Z",
  "category": "Travel",
  "location": "Australia",
  "featured": 0,
  "readTime": 5,
  "prevPostId": null,
  "nextPostId": null
}