{
  "id": 15,
  "title": "New Beginnings: When Distance is the Only Answer (Update02)",
  "slug": "new-beginnings-distance-needed",
  "excerpt": "Sometimes the bravest decision is to leave everything familiar behind. A reflection on new chapters and the courage to start over.",
  "content": "<p>So. I'm leaving New York.</p>\n\n      <p>Wasn't exactly planned, at least not this soon. But sometimes life has a way of making decisions for you.</p>\n\n      <p>I won't get into all the details here. Let's just say that staying in this city suddenly feels less like an option and more like a slow suffocation.</p>\n      \n      <p>Australia. It's literally on the opposite side of the planet, which feels right at the moment. A friend connected me with a job opportunity at a hotel group in Sydney, and I took it.</p>\n\n      <p>Mom thinks I'm running away. Dad says I'm being brave. The line between escape and adventure has always been blurry, hasn't it?</p>\n\n      <img src=\"/images/blog/2020_01_10-new-beginnings-distance-needed_img02.jpg\" alt=\"An empty suitcase waiting to be packed for a new life in Australia\" class=\"my-6 w-full rounded-lg shadow-md\" />\n\n      <p>My Sydney job starts in three weeks. The apartment is already sublet. Most of my stuff is either sold, donated, or packed into six suitcases. It's amazing how quickly you can dismantle a life when necessary.</p>\n\n      <p>Sarah asked if I was scared. Honestly? No. That's the strangest part. I'm feeling... relief? Maybe the fear will hit later.</p>\n\n      <p>Australia. Beaches and sunshine and people who've never met me before. People with no preconceptions or shared histories.</p>\n\n      <p>I fly out on Tuesday. This will be my last post for a while – apparently the Sydney apartment doesn't have WiFi set up yet, and I'm taking that as a sign from the universe to disconnect for a bit.</p>\n\n      <p>So here's to new beginnings. Here's to being somewhere new and different. Here's to seeing what else is out there.</p>",
  "coverImage": "/images/blog/2020_01_10-new-beginnings-distance-needed.jpg",
  "publishedAt": "2020-01-10T10:00:00Z",
  "category": "Personal",
  "location": "New York",
  "featured": 0,
  "readTime": 3,
  "prevPostId": null,
  "nextPostId": null
}