{
  "id": 17,
  "title": "Working Through a Pandemic: Hospitality in Uncertain Times",
  "slug": "pandemic-hospitality-uncertain-times",
  "excerpt": "Reflections on adapting to COVID-19 challenges in the luxury hotel industry and finding meaningful ways to serve during global disruption.",
  "content": "<p>Day 94 of this nightmare. I know I should be grateful to still have a job when so many of my colleagues have been let go, but honestly? Working in an empty hotel is eerie as hell. The Harbour View has 312 rooms and we currently have 8 guests. EIGHT. All of them are either stranded travelers who can't get flights home or business people serving mandatory quarantine. The massive lobby that used to buzz with activity now echoes with every footstep.</p>\n\n      <p>Four of our restaurant staff tested positive last week. Management tried to keep it quiet, but word spread quickly. Now everyone's on edge, giving each other suspicious looks when someone coughs or sneezes. We're wearing masks 24/7 which is giving me horrible acne along my jawline – real cute. The masks also hide our expressions, which makes it nearly impossible to do that warm, personal service thing that's like, literally my entire job.</p>\n\n      <p>Called my parents yesterday and broke down crying. Moving to Australia was supposed to be this grand adventure, and now I'm basically trapped here. Can't go home because of travel restrictions, can't properly explore my new country because everything's closed or limited. Mom tried to cheer me up by saying \"at least you're somewhere warm during all this,\" which just made me feel guilty for complaining at all.</p>\n\n      <p>The flip side is that the remaining staff has gotten super close. We've formed this strange little pandemic family. Raj from engineering taught me how to play cricket in the empty ballroom yesterday after our shifts (probably against some rule, but who's going to complain?). And Melanie from front desk has been teaching me Aussie slang – apparently I've been saying Melbourne all wrong.</p>\n\n      <p>The weirdest part of all this is how we've had to change our idea of what \"luxury service\" means. Used to be about anticipating needs, getting physically close to assist guests, creating these elaborate experiences. Now it's about making people feel safe. We're literally marketing our cleaning protocols as a luxury amenity. \"Enjoy our hospital-grade disinfection process!\" Never thought I'd see the day when I'd be proudly showing off our UV light sanitizing equipment to guests like it was a fancy amenity.</p>\n\n      <p>Management keeps saying things will bounce back, but I'm not so sure. Some days I think about just giving up and going back to the States (if they'd even let me in), but then I remember the job market there is probably even worse. So here I am, wearing my fancy uniform to serve eight people and disinfect surfaces that nobody's touched. What a time to be in hospitality.</p>",
  "coverImage": "/images/blog/2020_06_18-pandemic-hospitality-uncertain-times.jpg",
  "publishedAt": "2020-06-18T10:00:00Z",
  "category": "Hospitality",
  "location": "Australia",
  "featured": 0,
  "readTime": 6,
  "prevPostId": null,
  "nextPostId": null
}