{
  "id": 15,
  "title": "New Beginnings: When Distance is the Only Answer (Update02)",
  "slug": "new-beginnings-distance-needed",
  "excerpt": "Sometimes the bravest decision is to leave everything familiar behind. A reflection on new chapters and the courage to start over.",
  "content": "<p>So. I'm leaving New York. Like, for real leaving.</p>\n\n      <p>Wasn't the plan (at least not this soon), but sometimes life makes your decisions for you, right?</p>\n\n      <p>Not gonna dump all the messy details here. Short version: staying in NYC suddenly feels impossible. Like I literally can't breathe when I think about staying another month.</p>\n      \n      <p>Australia. AUSTRALIA. Literally the opposite side of the planet, which feels exactly right. My friend Jen (from culinary school) connected me with this hotel job in Sydney and I basically said yes before the interview was even over.</p>\n\n      <p>Mom's convinced I'm \"running away from my problems\" (her exact words on our last call). Dad keeps saying I'm being brave and adventurous. Maybe it's both? The line between escape and adventure has always been super blurry in my book.</p>\n\n      <img src=\"/images/blog/2020_01_10-new-beginnings-distance-needed_img02.jpg\" alt=\"An empty suitcase waiting to be packed for a new life in Australia\" class=\"my-6 w-full rounded-lg shadow-md\" />\n\n      <p>Start the new job in 3 weeks. Signed the sublease papers yesterday. Most of my stuff is sold or donated already - turns out my entire life fits into six suitcases. It's kinda shocking how fast you can tear down everything when you need to.</p>\n\n      <p>Sarah asked if I'm scared. Honestly? Weirdly no. That's the strangest part. All I feel is this massive RELIEF. Like I can finally breathe again. Maybe the terror will hit mid-flight... we'll see!</p>\n\n      <p>Australia. Beaches and sunshine and literally no one who knows anything about me. No one with expectations or histories or...complications. Just me and whatever version of myself I want to be now.</p>\n\n      <p>Flying out Tuesday. This'll be my last post for a bit - apparently my Sydney place doesn't have WiFi yet (how is that still a thing in 2020??), but honestly I'm taking it as a sign that I should disconnect from everything here for a while.</p>\n\n      <p>So here's to completely insane life decisions! Here's to running towards something instead of away from something (at least that's what I'm telling myself). Here's to finding out what else is out there besides this concrete jungle I've called home.</p>",
  "coverImage": "/images/blog/2020_01_10-new-beginnings-distance-needed.jpg",
  "publishedAt": "2020-01-10T10:00:00Z",
  "category": "Personal",
  "location": "New York",
  "featured": 0,
  "readTime": 3,
  "prevPostId": null,
  "nextPostId": null
}