{
  "id": 17,
  "title": "Working Through a Pandemic: Hospitality in Uncertain Times",
  "slug": "pandemic-hospitality-uncertain-times",
  "excerpt": "Reflections on adapting to COVID-19 challenges in the luxury hotel industry and finding meaningful ways to serve during global disruption.",
  "content": "<p>Day 94 of this COVID nightmare. Should be grateful to still have a job when half our staff's gone, but empty hotel = creepy AF. The Harbour View has 312 rooms and exactly 8 guests rn. EIGHT!!! Just stranded travelers or businesspeople in mandatory quarantine. Our lobby echoes like a horror movie whenever anyone walks through.</p>\n\n      <p>Four kitchen staff tested positive last week 😷 Management tried to keep it quiet (shocker) but word spread fast. Everyone's paranoid - death stares if someone clears their throat. Masks 24/7 giving me gross jawline acne. Plus masks hide expressions, making that warm, personal service thing (MY ENTIRE JOB) impossible.</p>\n\n      <img src=\"/images/blog/2020_06_18-pandemic-hospitality-uncertain-times_img02.jpg\" alt=\"The eerily empty luxury hotel lobby with sanitization stations\" class=\"my-6 w-full rounded-lg shadow-md\" />\n\n      <p>FaceTimed parents yesterday and lost it crying. Australia move was supposed to be an adventure, now I'm in pandemic purgatory. Can't go home bc travel restrictions, can't explore my new country bc everything's closed. Mom tried the \"at least you're somewhere warm\" thing which just made me feel like a brat for complaining when people are dying.</p>\n\n      <p>Silver lining: those of us left have gotten tight. Like this weird pandemic family. Raj from engineering taught me cricket in the empty ballroom after shifts (breaking rules but who's checking?). Mel from reception's teaching me Aussie slang - apparently I've been saying Melbourne wrong forever (it's \"MEL-bin\" not \"MEL-BORN\" who knew??)</p>\n\n      <p>Started silly traditions to stay sane. Fridays after shift = \"Fancy Apocalypse\" - raid unused mini bar and dress up in random stuff. Last week wore a tablecloth cape while Raj made a crown from folded room service menus. Childish but gives us something to look forward to.</p>\n\n      <p>Weirdest part is reimagining \"luxury service\" now. Used to be about anticipating needs, getting close to guests, creating experiences. Now it's JUST about making people feel SAFE. Marketing cleaning protocols as luxury amenities! \"Enjoy our hospital-grade disinfection!\" Never thought I'd proudly show off UV sanitizing equipment like some fancy feature.</p>\n\n      <p>Had heated debate with Michael about whether this changes hospitality forever or if everything bounces back post-vaccine. He thinks we return to normal - in-room dining, turndown service, packed bars. Not buying it. Something feels permanently different about shared spaces now. Maybe my NY paranoia but can't imagine looking at hotel buffets the same way. Communal tongs?? HARD PASS.</p>\n\n      <p>Getting creative with isolation. Created \"Quarantine Concierge\" packages for our few guests - movie nights with themed snacks, virtual wine tastings (bottles outside door, Zoom for guidance), even custom in-room workouts. Actually fun. Never thought my career would involve teaching a 60-year-old CEO yoga via FaceTime, but 2020 is nothing if not ~surprising~.</p>\n\n      <p>Management keeps saying things will bounce back but idk. Some days I consider giving up and trying to get home (if they'd let me in), but job market there is probably 10x worse. So here I am, fancy uniform to serve 8 people and obsessively disinfect surfaces nobody touches. What a time for luxury hospitality!!</p>",
  "coverImage": "/images/blog/2020_06_18-pandemic-hospitality-uncertain-times.jpg",
  "publishedAt": "2020-06-18T10:00:00Z",
  "category": "Hospitality",
  "location": "Australia",
  "featured": 0,
  "readTime": 6,
  "prevPostId": null,
  "nextPostId": null
}