{
  "id": 16,
  "title": "Sydney Calling: My Exciting New Job Opportunity (Update02)",
  "slug": "new-chapter-moving-sydney",
  "excerpt": "The exciting decision to relocate to Australia, the opportunities that await, and mixed emotions about leaving New York behind.",
  "content": "<p>I just accepted a dream job in Sydney! After years of working my way up in New York hospitality, I'm about to make the leap to international luxury hotel management. Just typing that feels surreal.</p>\n\n      <p>The job offer came out of nowhere and in the most unexpected way. Last October, I was assigned as the personal concierge for Olivia Hayes, the Creative Director of Harbour Luxury Group in Sydney. What began as simple concierge duties became long conversations about the differences between American and Australian hospitality approaches. By the end of her stay, we'd clicked professionally, and she mentioned they were expanding their events team and needed someone with a New York perspective.</p>\n\n      <p>\"Would you ever consider making a move to the Southern Hemisphere?\" she asked casually over breakfast on her last day. I laughed it off initially - Australia had never been on my radar. But then she followed up a week later with details about the role, and it sounded like someone had written a job description specifically for me.</p>\n\n      <img src=\"/images/blog/2020_01_20-new-chapter-moving-sydney_img02.jpg\" alt=\"My visa paperwork and one-way ticket to Sydney\" class=\"my-6 w-full rounded-lg shadow-md\" />\n\n      <p>After two months of Zoom interviews, sample event concepts, and what felt like a million emails, here's my new title: Experience Design Director for Harbour Luxury Group. I'll be overseeing guest experiences and special events across their three Sydney properties, bringing what they called a \"Manhattan sensibility\" to their Australian brand. The salary is 30% more than what I'm making now, they're providing housing for the first month, and there's a signing bonus that actually made me gasp when I saw the offer letter.</p>\n\n      <p>What excites me most is the creative freedom. Olivia explained that Australia's luxury market is evolving rapidly, with guests expecting more than just beautiful rooms and good service. They want narrative, personalization, and experiences they can't replicate elsewhere. My background in theatrical production before hospitality is apparently exactly what they're looking for - someone who can think about a hotel stay as a story rather than just a transaction.</p>\n\n      <p>Some of the ideas we've already discussed: partnerships with local artists to create room-specific installations that change seasonally; immersive dining experiences that incorporate Indigenous Australian ingredients and storytelling; and customized city exploration packages based on guests' personal interests rather than just the standard tourist routes.</p>\n\n      <p>I've spent the last week researching everything about the Australian hospitality industry and Sydney's current luxury landscape. The differences from New York are fascinating - there's more emphasis on indoor/outdoor living, a more relaxed approach to luxury (what they call \"barefoot luxury\"), and a blending of Asian and European influences that's unique to Australia's position in the world.</p>\n\n      <p>From a career perspective, this is a huge leap. Going from Events Manager at a single property to directing experiences across multiple venues is a big step up. There's also the international aspect - having Sydney on my resume opens doors to hotel groups around the world. And honestly, the timing couldn't be better. I was starting to feel like I'd hit a ceiling here in New York.</p>\n\n      <p>My boss was surprisingly supportive when I gave notice. \"This industry is global now,\" she said. \"You'd be crazy not to take this opportunity.\" She's even connected me with two colleagues who worked in Melbourne years ago. The hotel world is smaller than you'd think.</p>\n\n      <p>First project when I arrive: redesigning their harbor cruise experience for VIP guests. Second project: creating a signature welcome ritual for the new boutique property they're opening in September. I've already started sketching ideas and creating mood boards. Is it weird that I'm this excited about work?</p>\n\n      <p>Flight leaves in ten days. New job starts in two weeks. Sydney, I hope you're ready for a bit of New York energy!</p>",
  "coverImage": "/images/blog/2020_01_20-new-chapter-moving-sydney.jpg",
  "publishedAt": "2020-01-20T10:00:00Z",
  "category": "Personal",
  "location": "New York",
  "featured": 0,
  "readTime": 4,
  "prevPostId": null,
  "nextPostId": null
}