{
  "id": 15,
  "title": "New Beginnings: When Distance is the Only Answer",
  "slug": "new-beginnings-distance-needed",
  "excerpt": "Sometimes the bravest decision is to leave everything familiar behind. A reflection on new chapters and the courage to start over.",
  "content": "<p>So. I'm leaving New York.</p>\n\n      <p>That's still strange to type out. This wasn't exactly planned, at least not with this timeline. But sometimes life has a way of making decisions for you, or at least accelerating the ones floating in the back of your mind.</p>\n\n      <p>I won't get into all the messy details here. Some stories aren't meant for public consumption, at least not yet. Let's just say that certain bridges have been thoroughly burned, and staying in this city suddenly feels less like an option and more like a slow suffocation.</p>\n\n      <p>Australia. It's literally on the opposite side of the planet, which feels exactly right at the moment. Far enough away that accidental run-ins are impossible. Far enough that even the mutual connections become tenuous across that much distance and time difference.</p>\n\n      <p>Mom thinks I'm running away. Maybe she's right. Dad says I'm being brave. Maybe he's right too. The line between escape and adventure has always been blurry, hasn't it?</p>\n\n      <p>My Sydney job starts in three weeks. The apartment is already sublet. Most of my stuff is either sold, donated, or packed into six suitcases. It's amazing how quickly you can dismantle a life when necessary. Even more amazing how little I feel about watching it happen, like I'm observing someone else's life being tidied away.</p>\n\n      <p>Sarah asked if I was scared. Honestly? No. That's the strangest part. Everything in my life has just imploded, and I'm feeling... relief? Maybe the fear will hit later. Or maybe when you've already faced your worst-case scenario, the unknown doesn't seem quite so terrifying anymore.</p>\n\n      <p>New beginnings. Clean slates. Fresh starts. All those clichés people toss around like confetti. I used to think they were hollow phrases people used to paper over their failures. Now I understand – sometimes they're life rafts you cling to when everything else is sinking.</p>\n\n      <p>Australia. Beaches and sunshine and people who've never met me before. People with no preconceptions or shared histories or mutual friends who feel the need to take sides.</p>\n\n      <p>I fly out on Tuesday. This will be my last post for a while – apparently the Sydney apartment doesn't have WiFi set up yet, and I'm taking that as a sign from the universe to disconnect for a bit.</p>\n\n      <p>So here's to new beginnings, whatever forced them into existence. Here's to distance – geographical, emotional, temporal – and its power to heal what proximity only inflames. Here's to running away being, sometimes, the most honest form of moving forward.</p>",
  "coverImage": "/images/blog/2020_01_10-new-beginnings-distance-needed.jpg",
  "publishedAt": "2020-01-10T10:00:00Z",
  "category": "Personal",
  "location": "New York",
  "featured": 0,
  "readTime": 3,
  "prevPostId": null,
  "nextPostId": null
}