{
  "id": 18,
  "title": "Hunter Valley Vineyards: A Wine Education (Updated)",
  "slug": "hunter-valley-vineyards-wine-education",
  "excerpt": "Exploring Australia's oldest wine region and discovering how terroir translates into taste through immersive vineyard experiences.",
  "content": "<p>So I finally made it to the famous Hunter Valley wine region this weekend. Full disclosure: Despite my old weekend gig at that Oregon wine shop years ago, I went there feeling like a total novice when it comes to Australian wines. My basic knowledge of American Pinots doesn't exactly translate here. My Uber driver found my confusion about Australian varietals hysterical and spent the 40-minute ride calling me a 'typical American.' Whatever, mate.</p>\n\n      <p>The first vineyard we visited was this super fancy place with a gravel driveway longer than some NYC blocks. Was feeling pretty intimidated until I met our host, Dave, this 60-something guy with a wild gray beard and hands that looked like tree bark. No pretension whatsoever. When I admitted I couldn't tell the difference between a Shiraz and a Cab Sav (Australian wines are a whole new world compared to the Oregon Pinots I used to know something about), he just laughed and said, \"Perfect, blank slate!\" instead of the wine-snob judgment I was expecting.</p>\n\n      <p>The whole 'tasting' thing was overwhelming at first. Everyone around me was swirling and sniffing and talking about 'notes of blackberry and tobacco' while I was just trying not to spill on my white shirt. Made the rookie mistake of actually drinking each sample instead of spitting it out... by the third vineyard I was definitely feeling it. Ended up buying two bottles from the second place that I'm not convinced I actually liked, but the sommelier was really cute and I got flustered. Typical.</p>\n\n      <p>Best part of the day wasn't even planned. Our driver took a wrong turn (blame the windy roads, not the wine), and we ended up at this tiny family-owned place that wasn't on our itinerary. The owner, Margaret, was this no-nonsense woman who told us her grandkids made the labels. She poured us their Semillon straight from a tank rather than a bottle and explained that they'd had a terrible harvest that year because of the bushfires. The smoke had affected the grapes, she said, but she was still going to make wine from them and call it their 'Resilience Vintage.' That glass, sitting on a weathered picnic table with her three-legged dog snoring at my feet, tasted better than anything at the fancy estates.</p>\n\n      <p>Got home with a splitting headache, sunburned shoulders (note to self: Australian sun is NOT like New York sun), and a new appreciation for how much work goes into each bottle. Still can't tell you much about tannins or terroir, but I did learn that good wine is more about the stories and the people than the price tag. And also that you should definitely eat something substantial before a wine tour. Rookie error.</p>",
  "coverImage": "/images/blog/2020_08_14-hunter-valley-vineyards-wine-education.jpg",
  "publishedAt": "2020-08-14T10:00:00Z",
  "category": "Travel",
  "location": "Australia",
  "featured": 0,
  "readTime": 4,
  "prevPostId": null,
  "nextPostId": null
}