{
  "id": 16,
  "title": "Big News: I'm Moving to Sydney!",
  "slug": "new-chapter-moving-sydney",
  "excerpt": "The exciting decision to relocate to Australia, the opportunities that await, and mixed emotions about leaving New York behind.",
  "content": "<p>OMG I ACCEPTED A JOB IN SYDNEY!! After 2 years at The Luminous, I'm moving to AUSTRALIA. Still wondering if I'm having some elaborate dream.</p>\n\n      <p>Happened in the most random way. Remember that Australian hotel manager from October? Sarah from Harbour House? We chatted during check-in about events and somehow fell into this long convo about American vs Australian hospitality. Total checkout line friendship that should've ended there.</p>\n\n      <p>Then she mentioned opening a boutique hotel in Sydney, needing someone for their events program. Her words: \"We want someone who gets hospitality but isn't stuck in the Australian way.\" I laughed like \"I'm definitely no international expert\" but we kept emailing.</p>\n\n      <img src=\"/images/blog/2020_01_20-new-chapter-moving-sydney_img02.jpg\" alt=\"My visa paperwork and one-way ticket to Sydney\" class=\"my-6 w-full rounded-lg shadow-md\" />\n\n      <p>Fast forward through awkward Zoom interviews (time zones = BRUTAL) and one super stressed presentation pitching event ideas, they offered me the job!! I'll be Events Coordinator - handling their calendar, building partnerships with local food/wine places, creating visitor packages. They even want to do small weddings, perfect with my bridal salon background!</p>\n\n      <p>Pay's basically same as NY after currency conversion, but they're covering housing first month (!!) and hours way better than hotel life. PLUS sending me on local tours my first month to learn Sydney. Getting paid to be a tourist?? Is this real??</p>\n\n      <p>Been down the Sydney research rabbit hole HARD. Seems food-obsessed with incredible markets and restaurants. They're apparently serious about coffee (vital for my unhealthy caffeine addiction). And beaches after freezing NY winters? Yes please.</p>\n\n      <p>Hotel's close to wine regions! I know practically nothing about wine except bits from that Oregon shop job. Sarah said they sometimes send staff on vineyard tours to learn about local wines. Um, sign me up?</p>\n\n      <p>Australian food focuses on local, seasonal stuff - perfect for my sustainable hospitality obsession. Sarah said they're building relationships with local farmers/producers and I might help coordinate those partnerships!</p>\n\n      <p>My boss's face when I quit? PRICELESS. \"You're leaving Manhattan... for Australia?\" like I said Mars. But this feels right. Complete change, new challenges, and helping BUILD something from scratch instead of maintaining someone else's vision.</p>\n\n      <p>First Sydney to-dos: plan opening events and explore the neighborhood. The hotel's in Surry Hills, which Sarah called \"artsy but grown-up\" whatever that means!</p>\n\n      <p>Flight's in 10 days. Currently panic-watching Sydney videos at 2am and trying to learn Aussie slang from YouTube. What's a \"fair dinkum\"?? Why are flip-flops \"thongs\"?? So much to learn... but can't wait!!!</p>",
  "coverImage": "/images/blog/2020_01_20-new-chapter-moving-sydney.jpg",
  "publishedAt": "2020-01-20T10:00:00Z",
  "category": "Personal",
  "location": "New York",
  "featured": 0,
  "readTime": 4,
  "prevPostId": null,
  "nextPostId": null
}