{
  "id": 26,
  "title": "Time for Another Change: New Zealand Calling",
  "slug": "time-for-another-change-new-zealand-calling",
  "excerpt": "When life starts to feel too comfortable, sometimes it's a sign to shake things up again. Reflections on the decision to leave Sydney for New Zealand's shores.",
  "content": "<p>Apparently, I'm developing a pattern. Just as things get settled, I get restless.</p>\n\n      <p>Sydney has been good to me, mostly. Two years of beaches and flat whites and figuring out what the hell a \"servo\" is. I've made real friends, learned to navigate the train system without Google Maps, and found my favorite hidden cocktail bar where the bartender starts making my order when he sees me walk in.</p>\n\n      <p>So why leave? That's the question everyone keeps asking, usually with that slightly judgmental tone that suggests I'm being impulsive or ungrateful. My sort-of boyfriend Michael certainly thinks I'm running again. \"You've got commitment issues,\" he told me last night over what was supposed to be a nice dinner but turned into our final conversation. He's not entirely wrong. After dating casually for six months, he wanted me to move in. I responded by applying for jobs in another country. Classic Blaire move, I guess.</p>\n\n      <img src=\"/images/blog/2021_12_01-time-for-another-change-new-zealand-calling_img02.jpg\" alt=\"My packed suitcase ready for the journey to New Zealand, with Sydney Opera House viewable through the window\" class=\"my-6 w-full rounded-lg shadow-md\" />\n\n      <p>The truth is, I thought Australia was far enough away. From what exactly? From everything I was running from when I left New York. But some things follow you, even across oceans. Like your own patterns, for starters. And that restlessness that Mom calls my \"gypsy soul.\" New Zealand has great wine and cheese, and scenery that makes even the most stunning parts of Australia look ordinary.</p>\n\n      <p>The pandemic changed everything, of course. Working in an empty hotel for months, watching colleagues lose their jobs, being unable to travel home... it reshuffles your priorities. Makes you think about what you actually want, not just what you're running from.</p>\n\n      <p>And what I want, apparently, is New Zealand.</p>\n\n      <p>It started as idle browsing—just looking at job listings in Auckland one night after a particularly brutal shift. Then it became serious research. Then interviews. And now, an offer to help launch a boutique hotel consultancy focused on sustainable hospitality.</p>\n\n      <p>When I told Jen I was moving again, she just laughed and said, \"Of course you are.\" Not unkindly, but like she'd been expecting it. \"You're not built for staying put,\" she said. Maybe she's right. Or maybe I just haven't found the right place to put down roots yet.</p>\n\n      <p>I'm not running away this time. At least, I don't think I am. This feels more like running toward something. A new challenge, a different pace, a chance to apply everything I've learned in a place that values sustainability and connection with the land.</p>\n\n      <p>My flight's booked for January. I'll be quarantining for two weeks (third time's the charm, right?), and then stepping into yet another new life. My Sydney apartment is already on the market, my favorite plants have been adopted by friends, and I've started figuring out which books are worth the international shipping costs.</p>\n\n      <p>The hardest goodbye was with Michael. Despite how things ended romantically, he showed up with a bottle of New Zealand Sauvignon Blanc. \"Practice for your new home,\" he said. We sat on my half-packed living room floor and talked until the bottle was empty. \"You're going to thrive there,\" he said as he was leaving. \"Just remember it's okay to stay somewhere too.\"</p>\n\n      <p>Maybe one day I'll stay somewhere long enough to accumulate furniture that's not from IKEA. But not just yet. For now, I'm embracing this nomadic life I seem to have created for myself. Three countries in four years. If nothing else, it makes for an interesting resume.</p>\n\n      <p>To Sydney - thank you for the shelter during the storm, the lifelong friends, and teaching me that a swimsuit is valid everyday attire if you're confident enough. To Auckland - I'm coming. Get your flat whites ready.</p>",
  "coverImage": "/images/blog/2021_12_01-time-for-another-change-new-zealand-calling.jpg",
  "publishedAt": "2021-12-01T10:00:00Z",
  "category": "Personal",
  "location": "Australia",
  "featured": 0,
  "readTime": 4,
  "prevPostId": null,
  "nextPostId": null
}