{
  "id": 27,
  "title": "Looking Toward New Zealand: My Next Adventure",
  "slug": "looking-toward-new-zealand-next-adventure",
  "excerpt": "The decision to relocate to Auckland and the new professional chapter I'll be beginning in 2022 as I launch my own consultancy.",
  "content": "<p>They say that once you start traveling, it's difficult to stop. My journey from New York to Sydney has been transformative both personally and professionally, and now I'm embracing another transition: a move to New Zealand in early 2022.</p>\n\n      <p>This next step feels different from previous ones. I'll be joining the boutique hospitality consultancy firm Kiwi Luxury Experiences as their Director of Guest Experience Innovation—a smaller team but with the freedom to implement my own ideas about sustainable luxury.</p>\n\n      <img src=\"/images/blog/2021_12_05-looking-toward-new-zealand-next-adventure_img02.jpg\" alt=\"Me looking at Auckland harbor research materials and photos while planning for my new role\" class=\"my-6 w-full rounded-lg shadow-md\" />\n\n      <p>The job came through unexpectedly. Remember that sustainable hospitality conference in Melbourne? The keynote speaker, Claire, has been building this consultancy in Auckland. We kept in touch casually until last month, when she offered me this position.</p>\n\n      <p>Their philosophy perfectly matches my own—helping small to medium hospitality businesses develop distinctive, sustainable luxury experiences that highlight New Zealand's natural beauty and cultural heritage. No cookie-cutter corporate aesthetics, but an emphasis on meaningful connection to place.</p>\n\n      <p>The timing is perfect. I've felt myself hitting a ceiling professionally in Sydney. The larger hotel groups are too resistant to change, too wedded to pre-pandemic notions of luxury. I'm ready to work with clients who are genuinely excited about innovation.</p>\n\n      <p>I'll be working with their current clients—an eco-lodge in Waiheke Island, a boutique hotel in Wellington, and a luxury farm stay outside Auckland. My first month will be spent traveling to each property and developing tailored guest experience strategies.</p>\n\n      <p>What excites me most is pioneering regenerative tourism—the idea that travel should leave places better than it found them. This goes beyond sustainability to actively restoring environments and strengthening communities. One client has a reforestation program where guests plant native trees and can track \"their\" tree's growth over time using GPS coordinates.</p>\n\n      <p>My visa paperwork is complete, my apartment is sublet, and I've said my goodbyes. Now I'm in that strange liminal space between lives—not fully present in Sydney, but not yet established in Auckland.</p>\n\n      <p>My flight leaves in three weeks. Until then, I'm soaking up Sydney sunshine and visiting favorite spots one last time. I'm not sure when I'll be back, but something tells me Australia hasn't seen the last of me.</p>\n\n      <p>To New Zealand and new beginnings – I can't wait to see what this next chapter holds.</p>",
  "coverImage": "/images/blog/2021_12_05-looking-toward-new-zealand-next-adventure.jpg",
  "publishedAt": "2021-12-05T10:00:00Z",
  "category": "Personal",
  "location": "Australia",
  "featured": 0,
  "readTime": 4,
  "prevPostId": null,
  "nextPostId": null
}