{
  "id": 24,
  "title": "Winter in the Blue Mountains: A Weekend Retreat",
  "slug": "winter-blue-mountains-retreat",
  "excerpt": "Finding unexpected winter magic in the misty valleys and charming villages of New South Wales' most iconic mountain range.",
  "content": "<p>I'm writing this with frozen fingers because this \"charming heritage cottage\" in the Blue Mountains apparently doesn't believe in adequate heating. Note to self: when Australians describe something as having \"authentic period features,\" it means \"we haven't updated anything since 1932, including insulation.\"</p>\n\n      <p>This trip started as an escape from Sydney for a weekend. My housemate Jen has been driving me crazy with her kombucha experiments taking over our kitchen, so when a colleague offered her family's Blue Mountains cottage, I jumped at the chance.</p>\n\n      <p>The drive up was gorgeous. As we climbed into the mountains, ethereal mist wrapped around everything like a fairytale. This part of Australia is so different from the beaches I've gotten used to—all eucalyptus forests and dramatic cliff faces.</p>\n\n      <img src=\"/images/blog/2021_08_10-winter-blue-mountains-retreat_img02.jpg\" alt=\"View from the cottage window showing misty Blue Mountains forest at dawn\" class=\"my-6 w-full rounded-lg shadow-md\" />\n\n      <p>Reality hit when we arrived and discovered the heat was broken. The caretaker, Keith, with the thickest Aussie accent I've heard yet, just shrugged and said, \"Just use the fireplace, love.\" Thankfully it kept things cozy, despite my amateur fire-building skills.</p>\n\n      <p>We ventured into Leura for dinner, finding a tiny restaurant with no menu—the owner just tells you what they're cooking. The lamb stew was the best thing I've eaten since moving to Australia, paired perfectly with a local red wine.</p>\n\n      <p>This morning I woke to the cottage completely enveloped in fog. I embraced the spooky vibes and went for a walk. The silence was incredible—no traffic, no people, just occasional bird calls and water dripping from trees.</p>\n\n      <p>I followed Keith's recommended trail to Echo Point overlook with the Three Sisters rock formations. According to Aboriginal legend, they're sisters turned to stone for protection. The mist cleared just enough to see them appearing and disappearing like ghosts.</p>\n\n      <p>The cold is brutal, and I'm pretty sure there's a possum in the roof. Every time I drift off to sleep, there's scratching directly above. But looking out at the misty valley with my morning coffee, I get why people love this place.</p>\n\n      <p>Called Michael last night who laughed at my city-girl complaints about the cold. He grew up in Tasmania where this kind of weather is just called \"Tuesday.\" He's promised to show me hidden swimming holes and caves next time—not sure if that's enticing or terrifying.</p>\n\n      <p>Will I come back? Ask me after I've had a hot shower in Sydney tomorrow. But probably yes, just... maybe in spring.</p>",
  "coverImage": "/images/blog/2021_08_10-winter-blue-mountains-retreat.jpg",
  "publishedAt": "2021-08-10T10:00:00Z",
  "category": "Travel",
  "location": "Australia",
  "featured": 0,
  "readTime": 4,
  "prevPostId": null,
  "nextPostId": null
}