{
  "id": 26,
  "title": "Time for Another Change: New Zealand Calling",
  "slug": "time-for-another-change-new-zealand-calling",
  "excerpt": "When life starts to feel too comfortable, sometimes it's a sign to shake things up again. Reflections on the decision to leave Sydney for New Zealand's shores.",
  "content": "<p>Sooo here we go again! Just when everything gets comfortable and settled, I get that itch.</p>\n\n      <p>Sydney's been pretty amazing, not gonna lie. Two years of gorgeous beaches, the best coffee on earth, and finally figuring out that a \"servo\" is a gas station and not some weird Australian robot. Made actual real friends (not just work acquaintances), can navigate the trains without my phone, and found this perfect hidden cocktail spot where Jake starts making my gin fizz the second I walk in the door.</p>\n\n      <p>The million-dollar question everyone keeps asking with that annoying judgey tone: \"But WHY are you leaving?\" Like I'm being super impulsive or ungrateful. Michael (the sort-of boyfriend situation) definitely thinks I'm running again. \"You've got serious commitment issues, Blaire,\" he told me last night over what was supposed to be a cute dinner but turned into our breakup conversation. Can't really argue with him tbh. After 6 months of dating, he wanted me to move in with him. I responded by... applying for jobs in another country. Typical me, right?</p>\n\n      <img src=\"/images/blog/2021_12_01-time-for-another-change-new-zealand-calling_img02.jpg\" alt=\"My packed suitcase ready for the journey to New Zealand, with Sydney Opera House viewable through the window\" class=\"my-6 w-full rounded-lg shadow-md\" />\n\n      <p>Truth bomb: I thought Australia would be far enough. From what? From all the crap I was escaping when I left NYC. But turns out some baggage follows you EVERYWHERE. Like your own self-destructive patterns (hello therapy material). And that restlessness Mom always calls my \"gypsy soul\" (thanks for that label, Mom). Plus NZ has insanely good wine, killer cheese, and scenery that makes even Bondi Beach look basic.</p>\n\n      <p>The pandemic twisted everything sideways, obvs. Working in a hotel that was basically a ghost town for months, watching half my work friends get laid off, not being able to fly home when Dad got sick... it forces you to rethink your whole life. Makes you actually figure out what you WANT, not just what you're running from.</p>\n\n      <p>And apparently what I want is... New Zealand?!</p>\n\n      <p>It literally started as bored scrolling through Auckland job listings after a shift from hell. Then rabbit-holed into serious research. Then actual interviews (over Zoom, still weird). And now somehow I have a legit offer to help launch this bougie hotel consultancy focused on eco-friendly hospitality. The salary's actually decent and they're helping with relocation costs which is a FIRST.</p>\n\n      <p>When I told my bestie Jen about moving (again), she literally laughed and went \"Of course you are.\" Not mean, just like she'd been waiting for this announcement. \"Blaire, you're just not built for staying in one place.\" Maybe she's right? Or maybe the right place just hasn't found me yet.</p>\n\n      <p>This doesn't feel like running away this time. At least I'm telling myself that. More like running TOWARD something. A new challenge, different vibes, chance to use everything I've learned somewhere that actually cares about sustainability and isn't just greenwashing everything for Instagram.</p>\n\n      <p>Flight's booked for Jan 10. Gotta quarantine for two weeks (my third hotel quarantine, becoming an expert lol), then jumping into yet another new life. Already listed my apartment, my plants have all been adopted by friends (RIP Edgar my fiddle leaf fig, be good for Samantha), and I'm sorting through which books are actually worth the shipping $$$ (spoiler: fewer than I thought).</p>\n\n      <p>Saying goodbye to Michael was rough. Despite our mess of an ending, he showed up yesterday with a bottle of NZ Sauv Blanc. \"Practice for your new home,\" he said. We sat on my half-packed apartment floor and killed the whole bottle. His parting words: \"You're going to crush it there. Just maybe someday remember it's also OK to stay put.\" 😭</p>\n\n      <p>Maybe someday I'll actually stay somewhere long enough to buy real furniture instead of IKEA. But not yet! For now, I'm leaning into this nomad life I've somehow created. Three countries in four years. Makes for a wild resume if nothing else.</p>\n\n      <p>Sydney - thanks for the pandemic refuge, the lifelong friends, and teaching me that wearing a swimsuit as regular clothing is totally acceptable if you just own it. Auckland - I'm comin' for ya! Better have those flat whites ready!!</p>",
  "coverImage": "/images/blog/2021_12_01-time-for-another-change-new-zealand-calling.jpg",
  "publishedAt": "2021-12-01T10:00:00Z",
  "category": "Personal",
  "location": "Australia",
  "featured": 0,
  "readTime": 4,
  "prevPostId": null,
  "nextPostId": null
}