{
  "id": 4,
  "title": "Sustainable Fashion: Beyond the Buzzwords",
  "slug": "sustainable-fashion-beyond-buzzwords",
  "excerpt": "A deep dive into what makes fashion truly sustainable and the brands that are leading the ethical revolution.",
  "content": "<p>Been thinking loads about sustainable fashion lately. Sydney's totally changed my closet mindset - Aussies have this chill relationship with clothes, buying fewer, better pieces instead of chasing trends like we did in NY.</p>\n\n      <p>My Manhattan wardrobe? Packed with fast fashion I'd wear once or twice before they'd stretch, fade, or get boring. Been slowly swapping that disposable stuff with actual thoughtful buys since moving here.</p>\n\n      <img src=\"/images/blog/2021_04_10-sustainable-fashion-beyond-buzzwords_img02.jpg\" alt=\"My favorite sustainable linen dress from local Sydney designer against the harbor backdrop\" class=\"my-6 w-full rounded-lg shadow-md\" />\n\n      <p>So frustrating though - all these buzzwords! Everything's suddenly \"sustainable,\" \"eco-friendly,\" \"green,\" or \"clean.\" What does that even MEAN? Most terms have zero standard definitions, so brands just use them however they want.</p>\n\n      <p>Like \"organic\" cotton - unless it's GOTS certified, might be grown with fewer pesticides but still processed with nasty chemicals. Or \"vegan leather\" - usually just plastic. Trading animal welfare for plastic pollution? Not exactly a win.</p>\n\n      <p>Found some Aussie brands actually committed to the real deal - transparent supply chains, low-impact materials, designs meant to last. Yeah the prices are higher, but I'm thinking cost-per-wear now instead of just sticker price.</p>\n\n      <p>Michael teases me: \"Does it count as sustainable if you keep flying across the globe every few years?\" Ouch, fair point. My carbon footprint from international moves probably cancels any good my linen pants are doing. Still think these smaller choices matter though.</p>\n\n      <p>Some of the innovations blow my mind. This Melbourne designer works with pineapple leaf fibers (Piñatex!). Found a jacket made from recycled ocean plastic in Surry Hills. Brands using natural dyes from actual food waste to cut chemical runoff.</p>\n\n      <p>Biggest practical change? Just. Buying. Less. Trying this capsule wardrobe thing - fewer but versatile pieces that mix and match. So freeing to actually wear everything instead of that \"nothing to wear\" feeling despite owning tons.</p>\n\n      <p>Also loving secondhand shopping. Sydney has killer vintage stores - found this perfectly worn-in 90s denim jacket that's become my go-to.</p>\n\n      <p>Australia's shifted my whole perspective in ways I didn't expect. Something about living by the ocean makes environmental stuff feel way more real and personal.</p>",
  "coverImage": "/images/blog/2021_04_10-sustainable-fashion-beyond-buzzwords.jpg",
  "publishedAt": "2021-04-10T10:00:00Z",
  "category": "Fashion",
  "location": "Australia",
  "featured": 1,
  "readTime": 9,
  "prevPostId": null,
  "nextPostId": null
}