{
  "id": 27,
  "title": "Looking Toward New Zealand: My Next Adventure",
  "slug": "looking-toward-new-zealand-next-adventure",
  "excerpt": "The decision to relocate to Auckland and the new professional chapter I'll be beginning in 2022 as I launch my own consultancy.",
  "content": "<p>They say that once you start traveling, it's difficult to stop. My journey from New York to Sydney has been transformative both personally and professionally, and now I'm embracing another transition: a move to New Zealand in early 2022.</p>\n\n      <p>This next step feels different from previous ones. Rather than joining an established organization, I'll be launching a new chapter in my career with the boutique hospitality consultancy firm Kiwi Luxury Experiences. It's a smaller team than I'm used to, but with the freedom to really implement my own ideas about sustainable luxury and authentic guest experiences.</p>\n\n      <img src=\"/images/blog/2021_12_05-looking-toward-new-zealand-next-adventure_img02.jpg\" alt=\"Me looking at Auckland harbor research materials and photos while planning for my new role\" class=\"my-6 w-full rounded-lg shadow-md\" />\n\n      <p>The job came through in the most unexpected way. Remember that sustainable hospitality conference I attended in Melbourne last spring? Turns out the keynote speaker, Claire, has been quietly building this consultancy in Auckland for the past two years. We kept in touch casually – occasional emails about interesting industry trends, that sort of thing. Then last month, she reached out with this proposition: join their team as Director of Guest Experience Innovation.</p>\n\n      <p>When she described their philosophy, it was like she was reading from my personal manifesto. They're focused on helping small to medium hospitality businesses develop distinctive, sustainable luxury experiences that highlight New Zealand's natural beauty and cultural heritage. No cookie-cutter corporate hotel aesthetics, no generic luxury tropes. They want to redefine luxury hospitality for a post-pandemic world, with an emphasis on meaningful connection to place.</p>\n\n      <p>The timing couldn't be better. Sydney has been wonderful in many ways, but I've felt myself hitting a ceiling professionally. The larger hotel groups I've been working with are too resistant to change, too wedded to pre-pandemic notions of what luxury means. I'm ready to work with properties and clients who are genuinely excited about innovation.</p>\n\n      <p>Claire has already connected me with their current clients – an eco-lodge in Waiheke Island, a boutique hotel in Wellington, and a luxury farm stay outside Auckland. I'll be spending my first month in New Zealand traveling to each property, getting to know their operations and developing tailored guest experience strategies.</p>\n\n      <p>I've been deep in research mode, learning everything I can about New Zealand hospitality traditions, from Māori hosting practices to the country's wine tourism scene. Did you know New Zealand has over 700 wineries, but most are small-scale operations that emphasize quality over quantity? The approach to wine seems emblematic of the broader New Zealand ethos – thoughtful, quality-focused, and deeply connected to the land.</p>\n\n      <p>What excites me most is the opportunity to work with properties that are pioneering regenerative tourism – the idea that travel should leave places better than it found them. This goes beyond sustainability (merely doing less harm) to actively restoring natural environments and strengthening communities. One of our clients has a reforestation program where guests can help plant native trees during their stay, with GPS coordinates so they can track \"their\" tree's growth over time. Another partners with local Māori artists to showcase indigenous perspectives throughout the guest experience.</p>\n\n      <p>My visa paperwork is finally complete (bureaucracy waits for no pandemic), my apartment is sublet, and I've said the hardest goodbyes. Now I'm in that strange liminal space between lives – no longer fully present in Sydney, but not yet established in Auckland. I'm filling the time with elaborate research documents, virtually touring potential apartments, and practicing how to pronounce Māori place names correctly.</p>\n\n      <p>Yesterday I called Claire in a mild panic, questioning whether I'm making the right choice. \"Blaire,\" she said with that distinctive Kiwi directness, \"everyone feels like this before a big move. But I've never met anyone who regretted following their professional passion.\" She's right, of course. The anxiety is just part of the process.</p>\n\n      <p>My flight leaves in three weeks. Until then, I'm trying to soak up as much Sydney sunshine as possible and finish my goodbye tour of favorite restaurants and beaches. I'm not sure when I'll be back, but something tells me Australia hasn't seen the last of me. After all, it's just a short flight across the Tasman.</p>\n\n      <p>To New Zealand and new beginnings – I can't wait to see what this next chapter holds.</p>",
  "coverImage": "/images/blog/2021_12_05-looking-toward-new-zealand-next-adventure.jpg",
  "publishedAt": "2021-12-05T10:00:00Z",
  "category": "Personal",
  "location": "Australia",
  "featured": 0,
  "readTime": 4,
  "prevPostId": null,
  "nextPostId": null
}