{
  "id": 34,
  "title": "The Fern Boutique Hotel: Collaborating with Auckland's Design Icon",
  "slug": "fern-boutique-hotel-auckland-design-icon",
  "excerpt": "The joy of partnering with one of New Zealand's most distinctive boutique hotels and how our collaboration is creating unique guest experiences.",
  "content": "<p>Some places just have a SOUL you feel right away. The Fern Boutique Hotel is one of those - art deco atrium, bold striped carpets, amazing NZ art collection. First time I walked in I was like YES - this matches my whole hospitality vibe. Design-forward but actually comfortable, distinctive without being pretentious.</p>\n\n      <p>Got the chance to partner with them on events and guest experiences and jumped on it. Now we're creating these cultural salons bringing local artists, winemakers, and chefs together for intimate evenings showcasing Auckland's creative scene.</p>\n\n      <img src=\"/images/blog/2022_11_10-fern-boutique-hotel-auckland-design-icon_img02.jpg\" alt=\"The library lounge at The Fern Boutique Hotel with custom furniture and local artwork\" class=\"my-6 w-full rounded-lg shadow-md\" />\n\n      <p>Always thought hotels should be more than just fancy beds - they should connect you to a place's essence. The Fern nails this. While so many boutique hotels feel interchangeably hip worldwide, The Fern is distinctly Kiwi. Reception desk made from native rimu wood, staff uniforms by local designer Juliette Hogan - everything tells a story about NZ creativity.</p>\n\n      <p>What makes working with them so cool is how they treat hospitality as cultural curation. Instead of just standard luxury stuff, they create meaningful connections between guests and local creatives. Matches perfectly with what I've been doing with my consulting clients.</p>\n\n      <p>Our first project last month? Intimate dinner for twenty pairing the hotel's chef with Māori chef Monique Fiso for seven courses featuring native ingredients. Between courses, a local plant expert shared stories about each ingredient's cultural significance. Set it all up in their winter garden with a tablescape using woven harakeke (flax) and ceramics by local potter Kirsten Dryburgh.</p>\n\n      <p>Love that The Fern team gets that real luxury = depth of experience, not just surface flashiness. Their GM David worked at super opulent Middle East properties with gold everything. He brings that service precision but applies it to a more thoughtful, culturally rich approach.</p>\n\n      <p>This month we're launching \"Creative Confluences\" - pairing different art forms for one-night experiences throughout the hotel. First event has a contemporary dancer responding to works by painter Shane Cotton (his massive canvas dominates the mezzanine). Guests watch while sipping cocktails inspired by the painting's colors and themes.</p>\n\n      <p>Started recommending The Fern to my wedding clients for guest accommodation - not just for the gorgeous rooms but the overall experience. Several couples have booked the entire place for wedding weekends, creating experiences beyond just ceremony and reception.</p>\n\n      <p>In an industry that's often so transactional, it's refreshing to work with people who get the transformative potential of thoughtful experiences. Our collaboration feels less like business and more like kindred spirits showing off the best of NZ's creative energy.</p>",
  "coverImage": "/images/blog/2022_11_10-fern-boutique-hotel-auckland-design-icon.jpg",
  "publishedAt": "2022-11-10T10:00:00Z",
  "category": "Hospitality",
  "location": "New Zealand",
  "featured": 0,
  "readTime": 5,
  "prevPostId": null,
  "nextPostId": null
}