{
  "id": 27,
  "title": "Auckland Arrival: Urban Sophistication Meets Island Paradise (Updated)",
  "slug": "auckland-arrival-urban-sophistication",
  "excerpt": "First impressions of New Zealand's largest city and the unexpected ways it differs from both New York and Sydney.",
  "content": "<p>The old saying \"third time's a charm\" better be true because I've just landed in my third country in three years. Moving to Auckland wasn't exactly planned (is anything in my life at this point?), but when the boutique hotel consultancy opportunity came up, how could I say no? Though after my third miserable quarantine experience, I was seriously questioning my life choices. 14 days in a hotel room with windows that don't open should be classified as some form of torture.</p>\n\n      <p>First real observation: Auckland feels weirdly like a hybrid of Sydney and San Francisco. It's hilly like SF but with Sydney's water-centric vibe. They call it the \"City of Sails\" which sounded cheesy until I actually saw the harbor – holy crap, there are boats EVERYWHERE. My Uber driver from the quarantine hotel (freedom day!) told me he lives on his sailboat and only rents a tiny studio for showering and laundry. Making me rethink my overpriced temporary apartment...</p>\n\n      <p>Speaking of which, apartment hunting here is a nightmare. Everything is either astronomically expensive or has \"character features\" (translation: mold). Saw five places yesterday and almost cried at the last one because I was so tired and the real estate agent kept hard-selling this place that smelled like wet dog. Ended up panic-signing for a tiny studio in Ponsonby that costs more than my first apartment in Manhattan. But it has a sliver of harbor view and is walking distance to work, so I'm calling it a win.</p>\n\n      <p>The Kiwi accent is throwing me for a loop. I thought after two years in Australia I'd be prepared, but nope. Ordered a \"deck chair\" at a store and the salesperson looked horrified until I realized how it sounded with their accent pronunciation. Mortifying. Also can't get used to people calling flip-flops \"jandals\" here. Every country seems determined to confuse me with different names for the exact same footwear.</p>\n\n      <p>One thing that's genuinely blown me away: you can be in the middle of downtown Auckland, surrounded by skyscrapers and fancy shops, then drive 30 minutes and be on a freaking black sand beach that looks like something from another planet. Went to Piha yesterday just to explore and ended up staying for hours watching surfers. The iron in the sand makes it sparkle in the sunlight. Also got absolutely destroyed by sunburn because I still haven't learned my lesson about the UV index in this part of the world. My nose is currently the color and texture of a ripe tomato.</p>\n\n      <p>Everyone here keeps asking if I've been to Waiheke Island yet, apparently it's wine country paradise a short ferry ride away. That's on the agenda for this weekend if I can find someone to go with. Making friends as an adult in a new country is exhausting. Maybe I'll just take myself on a solo wine tour. Wouldn't be the first time.</p>\n\n      <p>Work starts for real on Monday. I'm equal parts excited and terrified. The consulting gig sounded amazing on paper, but now I'm worried I oversold my experience in the interview. Classic impostor syndrome kicking in. But hey, if I can survive New York hospitality and a pandemic in Sydney, I can handle whatever Auckland throws at me... right?</p>",
  "coverImage": "/images/blog/2022_01_20-auckland-arrival-urban-sophistication.jpg",
  "publishedAt": "2022-01-20T10:00:00Z",
  "category": "Travel",
  "location": "New Zealand",
  "featured": 0,
  "readTime": 4,
  "prevPostId": null,
  "nextPostId": null
}