{
  "id": 28,
  "title": "Auckland Arrival: Urban Sophistication Meets Island Paradise",
  "slug": "auckland-arrival-urban-sophistication",
  "excerpt": "First impressions of New Zealand's largest city and the unexpected ways it differs from both New York and Sydney.",
  "content": "<p>Sooo I've now lived in THREE countries in three years. Totally normal life trajectory, right? 😅 This Auckland move wasn't exactly part of any grand plan, but the boutique hotel consulting gig was too good to pass up. Did my time in hotel quarantine (14 days of second-guessing every life choice while doom-scrolling apartment listings and watching terrible NZ reality TV).</p>\n\n      <p>First thoughts on Auckland - it's weirdly like if Sydney and San Francisco had a baby? Super hilly like SF but with Sydney's water-everywhere vibe. They call it the \"City of Sails\" and OMG it's accurate - the harbor is PACKED with boats. My Uber driver from quarantine (Dave, absolute legend) casually mentioned he LIVES on his sailboat and just rents a tiny room on land for laundry and mail. That got me thinking... boat life?? Probably a terrible idea for someone who gets motion sickness on escalators but still sounds romantic.</p>\n\n      <img src=\"/images/blog/2022_01_20-auckland-arrival-urban-sophistication_img02.jpg\" alt=\"View from my Ponsonby apartment of Auckland harbor with sailboats\" class=\"my-6 w-full rounded-lg shadow-md\" />\n\n      <p>Apartment hunting was... an adventure. Found a tiny but cute studio in Ponsonby that's definitely overpriced (but what isn't these days?). Has decent harbor views if I lean out the window and squint, but the real selling point is being able to walk to work. After five viewings in one day and being told repeatedly that I needed to decide IMMEDIATELY because someone else was about to take it (oldest trick in the real estate book), I caved and signed the lease. It's basically a glorified shoebox, but the location is *chef's kiss*.</p>\n\n      <p>Best thing about Auckland so far? You can be in ACTUAL NATURE in like 30 minutes. Went to this place called Piha yesterday - black sand beaches!!! Had only seen them in photos before. The sand literally sparkles from all the iron in it. Spent hours watching surfers tackle these massive waves while I nursed my sunburn. Note to self: the NZ sun is BRUTAL. SPF 50 is basically SPF 10 here. My shoulders are currently the color of a ripe tomato despite applying sunscreen twice.</p>\n\n      <p>Everyone I've met (all 7 people lol) keeps telling me I MUST visit Waiheke Island for wine tasting. Apparently it's just a quick ferry ride from downtown. Already booked myself a ticket for Saturday. Going solo because 1) don't know anyone here yet and 2) sometimes that's the best way to explore anyway. Plus I can hit as many wineries as I want without judgment!</p>\n\n      <p>Start the new job on Monday and lowkey freaking out. Spent way too much on a \"professional but cool\" outfit yesterday. The position sounds perfect on paper - using everything I learned in NYC and Sydney but with a focus on sustainability which NZ seems to take way more seriously than anywhere else I've lived. Curious how my fancy hotel experience translates to boutique eco-lodges. Do they even want turndown service with handcrafted chocolates? Will find out soon enough!</p>",
  "coverImage": "/images/blog/2022_01_20-auckland-arrival-urban-sophistication.jpg",
  "publishedAt": "2022-01-20T10:00:00Z",
  "category": "Travel",
  "location": "New Zealand",
  "featured": 0,
  "readTime": 4,
  "prevPostId": null,
  "nextPostId": null
}