{
  "id": 28,
  "title": "Auckland Arrival: Urban Sophistication Meets Island Paradise",
  "slug": "auckland-arrival-urban-sophistication",
  "excerpt": "First impressions of New Zealand's largest city and the unexpected ways it differs from both New York and Sydney.",
  "content": "<p>Well, here I am in my third country in three years. Moving to Auckland wasn't exactly in my five-year plan, but the boutique hotel consultancy opportunity seemed too good to pass up. The quarantine process was certainly an experience - 14 days gives you plenty of time to second-guess your decisions and scroll through real estate listings.</p>\n\n      <p>First impression: Auckland reminds me of both Sydney and San Francisco. It's hilly like SF but has Sydney's connection to the water. They call it the \"City of Sails\" and it's easy to see why - the harbor is filled with boats of all sizes. My Uber driver from the quarantine hotel mentioned he lives on his sailboat and just rents a small place for practical necessities. That got me thinking about alternative housing options.</p>\n\n      <img src=\"/images/blog/2022_01_20-auckland-arrival-urban-sophistication_img02.jpg\" alt=\"View from my Ponsonby apartment of Auckland harbor with sailboats\" class=\"my-6 w-full rounded-lg shadow-md\" />\n\n      <p>Speaking of housing, apartment hunting has been interesting. Found a small studio in Ponsonby that's a bit overpriced but has a nice view of the harbor and is within walking distance to work, which is a priority for me. The location makes up for the size limitations.</p>\n\n      <p>One thing I really appreciate about Auckland is how quickly you can get from city to nature. Just a 30-minute drive from downtown and you're at Piha with its beautiful black sand beaches. Spent a lovely afternoon there yesterday watching the surfers and enjoying the scenery. The iron content in the sand gives it a unique sparkle in the sunlight. Note to self: the sun is still stronger here than I'm used to.</p>\n\n      <p>Everyone keeps recommending Waiheke Island for its vineyards. It's apparently just a short ferry ride away, so I've added it to my weekend plans. Might make it a solo trip - sometimes that's the best way to explore a new place anyway.</p>\n\n      <p>Work begins on Monday and I'm looking forward to the new challenge. The consulting position sounds like a great opportunity to use the experience I gained in both New York and Sydney. I'm curious to see how the hospitality industry differs here in New Zealand.</p>",
  "coverImage": "/images/blog/2022_01_20-auckland-arrival-urban-sophistication.jpg",
  "publishedAt": "2022-01-20T10:00:00Z",
  "category": "Travel",
  "location": "New Zealand",
  "featured": 0,
  "readTime": 4,
  "prevPostId": null,
  "nextPostId": null
}