{
  "id": 28,
  "title": "Auckland Arrival: Urban Sophistication Meets Island Paradise",
  "slug": "auckland-arrival-urban-sophistication",
  "excerpt": "First impressions of New Zealand's largest city and the unexpected ways it differs from both New York and Sydney.",
  "content": "<p>Sooo I've now lived in THREE countries in three years. Normal life path, right? 😅 Auckland move wasn't planned, but this boutique hotel consulting gig was too good to pass up. Just finished hotel quarantine (14 days second-guessing life choices while doom-scrolling apartments and watching terrible NZ reality TV).</p>\n\n      <p>First impression of Auckland - like Sydney and San Francisco had a baby? Hilly like SF but with water everywhere like Sydney. They call it \"City of Sails\" and it's SO accurate - harbor PACKED with boats. My quarantine Uber driver (Dave, legend) casually mentioned he LIVES on his sailboat, just rents a tiny room on land for laundry and mail. Got me thinking... boat life?? Terrible idea for someone with motion sickness on escalators but sounds romantic.</p>\n\n      <img src=\"/images/blog/2022_01_20-auckland-arrival-urban-sophistication_img02.jpg\" alt=\"View from my Ponsonby apartment of Auckland harbor with sailboats\" class=\"my-6 w-full rounded-lg shadow-md\" />\n\n      <p>Apartment hunting = adventure. Found tiny cute studio in Ponsonby that's definitely overpriced (what isn't?). Has harbor views if I lean out the window and squint, but main selling point is walking to work. After 5 viewings in one day and constant \"decide NOW someone else wants it\" pressure (oldest real estate trick), I caved and signed. Basically a glorified shoebox, but location = *chef's kiss*.</p>\n\n      <p>Best Auckland thing? ACTUAL NATURE in 30 minutes. Went to Piha yesterday - BLACK SAND BEACHES!! Only seen in photos before. Sand literally sparkles from iron content. Watched surfers on massive waves while nursing my sunburn. Note: NZ sun is BRUTAL. SPF 50 is like SPF 10 here. My shoulders = color of ripe tomato despite double sunscreen.</p>\n\n      <p>Everyone I've met (all 7 people lol) says I MUST do Waiheke Island wine tasting. Just a quick ferry from downtown. Booked for Saturday. Going solo because 1) know nobody here yet and 2) sometimes that's best way to explore. Plus can hit multiple wineries without judgment!</p>\n\n      <p>Start job Monday and freaking out. Spent too much on a \"professional but cool\" outfit yesterday. Position sounds perfect - using everything from NYC and Sydney but with sustainability focus which NZ takes seriously. Wonder how fancy hotel experience translates to boutique eco-lodges. Do they even want turndown service with handcrafted chocolates? We'll see!</p>",
  "coverImage": "/images/blog/2022_01_20-auckland-arrival-urban-sophistication.jpg",
  "publishedAt": "2022-01-20T10:00:00Z",
  "category": "Travel",
  "location": "New Zealand",
  "featured": 0,
  "readTime": 4,
  "prevPostId": null,
  "nextPostId": null
}