{
  "id": 29,
  "title": "Launching a Boutique Consultancy: Lessons from Month One",
  "slug": "launching-boutique-consultancy-month-one",
  "excerpt": "The exhilarating reality of building a business from scratch and the unexpected skills I've had to develop beyond my hospitality expertise.",
  "content": "<p>They don't teach you about bookkeeping systems or contract templates in hospitality school. The past month of establishing my role at Kiwi Luxury Experiences has been an education in aspects of business I never considered while focused on creating beautiful experiences for others.</p>\n\n      <p>The learning curve has been steep but exhilarating. Each day brings new challenges—from contributing to our brand identity to establishing service packages to building a network in a new country. What sustains me through the administrative details is the vision of creating truly distinctive, personalized experiences that honor New Zealand's exceptional landscapes and cultures.</p>\n\n      <img src=\"/images/blog/2022_03_08-launching-boutique-consultancy-month-one_img02.jpg\" alt=\"My workspace with mood boards and client presentations spread across the table\" class=\"my-6 w-full rounded-lg shadow-md\" />\n\n      <p>Our first client meeting was at a boutique lodge on Waiheke Island. I arrived early, feeling oddly nervous despite years of hospitality experience. This was different—I wasn't representing someone else's vision but helping craft something new. The owner, a former corporate executive who left to pursue her passion, immediately put me at ease. We spent the afternoon walking her property, discussing how to incorporate Māori cultural elements respectfully while enhancing the guest experience.</p>\n\n      <p>Claire's vision for the consultancy perfectly complements my background. Her strategic business sense paired with my experiential design approach makes for a powerful combination. We've already signed three more clients than anticipated for our first quarter.</p>\n\n      <p>The Auckland business community has been surprisingly welcoming. There's a sense of openness to new ideas here that I didn't always find in more established hospitality markets. Perhaps it's because New Zealand tourism is still defining itself on the global luxury stage.</p>\n\n      <p>Tonight I'm finalizing our presentation for a wellness retreat in Queenstown—my first solo client pitch. Wish me luck!</p>",
  "coverImage": "/images/blog/2022_03_08-launching-boutique-consultancy-month-one.jpg",
  "publishedAt": "2022-03-08T10:00:00Z",
  "category": "Personal",
  "location": "New Zealand",
  "featured": 0,
  "readTime": 5,
  "prevPostId": null,
  "nextPostId": null
}