{
  "id": 45,
  "title": "First Week in Martinborough: Town Square, Wine Streets & Good Eats",
  "slug": "martinborough-first-impressions-square-wine-streets",
  "excerpt": "A few days into settling in Martinborough and I'm noticing the quirky details of this wine town.",
  "content": "<p>Ok so this tiny town is built around a lil square - v different vibe from Auckland's sprawl. Weirdest thing is all the streets named after international places - Venice St, Dublin St, etc. Like some wine-soaked fantasy of world travel lol.</p>\n\n      <p>Get this - the fancy new housing development is legit called \"Pinot Place\" 😂 These ppl are COMMITTED to the wine brand. Can't blame em, the stuff is good.</p>\n\n      <p>Been eating my way thru town (obv):</p>\n\n      <ul class=\"list-disc pl-6 my-4\">\n        <li class=\"mb-2\"><span class=\"font-semibold\">Luna</span> - Solid place. Cute waiter who didn't judge when I asked stupid wine qs. Gotta try their \"special\" pinot next time (is it actually special or just marketing? tbd)</li>\n        <li class=\"mb-2\"><span class=\"font-semibold\">Tohi</span> - Gin bar w/ Asian food that's actually got spice. The owner makes these weird gin infusions that are either brilliant or terrible, no in-between.</li>\n        <li class=\"mb-2\"><span class=\"font-semibold\">Na Ra</span> - OMG their chicken & waffles!! Worth the move alone tbh</li>\n      </ul>\n\n      <p>Everything moves sloooow here. 20min convo with the bakery lady about her cat this morning. Everyone knows everyone's biz. Kinda nice after city anonymity? I dunno yet. Anyway, gonna chill for a couple weeks, find a car (my poor car won't make it on these country roads), poke around Wairarapa and maybe pop into Welly when I need a proper coffee.</p>",
  "coverImage": "/images/blog/2025_02_10-martinborough-first-impressions.jpg",
  "publishedAt": "2025-02-10T18:30:00Z",
  "category": "Travel",
  "location": "New Zealand",
  "featured": 0,
  "readTime": 2,
  "prevPostId": null,
  "nextPostId": null
}