{
  "id": 98,
  "title": "Trading City Lights for Vineyard Nights: My Move to Martinborough",
  "slug": "leaving-auckland-for-small-town-life",
  "excerpt": "After years in major cities, I'm making the leap to small-town life in wine country, trading convenience for connection and finding unexpected peace.",
  "content": "<p>I've shocked everyone again. Three years in Auckland, the longest I've stayed anywhere since leaving New York, and just when people thought I might actually put down roots... I'm moving to a town with one main street and more grapevines than people.</p>\n\n      <p>Martinborough wasn't even on my radar six months ago. I came here for a weekend wine tour with clients, expecting to enjoy the Pinot Noir and head straight back to city life. Instead, I found myself lingering, coming back on my days off, and eventually having that dangerous thought that changes everything: \"I could live here.\"</p>\n\n      <p>When I told my Auckland friends I was leaving, the reactions ranged from disbelief to something close to intervention. \"But what will you DO there?\" asked Mika, who thinks anything outside Auckland's city limits is basically wilderness. \"There's only like three restaurants!\" (There are seven, actually, I counted.) \"You'll be bored in a month!\"</p>\n\n      <p>Maybe they're right. Maybe this is a mid-life crisis hitting early. But after a decade in New York, then Sydney, then Auckland – all places where success is measured by how busy you are, how important you seem, how many connections you have – I'm craving something else.</p>\n\n      <p>The consultancy has been good to me, but after three years, I'm burned out from the constant travel, the client demands, the pressure to be constantly \"on.\" I found myself scheduling 15-minute windows to call my mom. SCHEDULING. CALLS. TO. MY. MOTHER. When did I become that person?</p>\n\n      <p>So when The Vine & Table offered me the chance to come on as their hospitality director, overseeing just one property instead of advising on twenty, I surprised myself by saying yes before they even finished their pitch. A salary cut, sure. A step down in prestige, definitely. But also: a cottage with a garden. Mornings that don't start with a commute. A community where people know your name.</p>\n\n      <p>I've spent so much of my adult life running to new places, always chasing something bigger or more exciting. New York because it was the center of everything. Sydney to escape and start fresh. Auckland for the career opportunity. Each move made sense at the time.</p>\n\n      <p>But Martinborough? This one's different. For the first time, I'm not running from something or chasing after something. I'm choosing a place because of how it feels. Because when I walk through the vineyards at sunset and smell the earth and the grapes, something in me settles. Because the café owner already knows my coffee order after just three visits. Because I can see stars at night – actual stars, not just the brightest few fighting through city light pollution.</p>\n\n      <p>Will I regret walking away from the fast-paced career I've built? Will I miss having Uber Eats and 24-hour convenience stores and being able to find a good cocktail at 1 AM? Probably, sometimes. But I've spent enough time in those places to know they'll always be there if I want to go back.</p>\n\n      <p>What I can't get back are the years ahead – years I want to spend somewhere that feels like it could become home. Not just another cool address on my resume, but a place where I might actually unpack all those boxes I've been moving from country to country.</p>\n\n      <p>The cottage I'm renting has a small vineyard attached – just a few rows, nothing commercial. The owner said I can try making my own wine if I want. Me! Making wine! I know absolutely nothing about viticulture, but somehow that feels exactly right. Starting something new, learning as I go, putting down literal roots.</p>\n\n      <p>I move in next week. My Auckland apartment is already half-packed, and I've found myself being ruthless about what comes with me this time. If the last decade has taught me anything, it's that I need far less than I think I do.</p>\n\n      <p>So here's to small towns, to slower living, to wine and cheese and scenery. Here's to Martinborough – the place I'm not running to, but walking towards, deliberately and hopefully. The place that, just maybe, might finally be home.</p>",
  "coverImage": "/images/blog/2025_01_05-leaving-auckland-for-small-town-life.jpg",
  "publishedAt": "2025-01-05T10:00:00Z",
  "category": "Personal",
  "location": "New Zealand",
  "featured": 0,
  "readTime": 5,
  "prevPostId": null,
  "nextPostId": null
}