{
  "id": 98,
  "title": "Trading City Lights for Vineyard Nights: My Move to Martinborough",
  "slug": "leaving-auckland-for-small-town-life",
  "excerpt": "After years in major cities, I'm making the leap to small-town life in wine country, trading convenience for connection and finding unexpected peace.",
  "content": "<p>Sooo I did it again 🙈 Three years in Auckland (my record since NYC!) and right when everyone thought I was finally settling down... I'm bailing to a tiny town with ONE traffic light and vineyard rows for days.</p>\n\n      <p>Wasn't even thinking about Martinborough till last summer. Came for a client wine weekend, just planning to drink some decent pinot noir and bounce back to civilization. But something weird happened. Kept making excuses to come back. Days off? Martinborough. Long weekend? Martinborough. Then that dangerous AF thought: \"I could totally live here.\"</p>\n\n      <p>Told my Auckland crew last week and omg the DRAMA. \"What the hell will you DO there?\" Mika practically yelled. She thinks anything past Mt Eden is basically farm country lol. \"There's like 3 restaurants!\" (There's 7 actually, I counted like a nerd.) \"You'll lose your mind in a month!\"</p>\n\n      <p>Maybe they're right? Maybe I'm just havin a quarter-life crisis or wtv. But after bouncing from NY to Sydney to Auckland—I'm just... tired.</p>\n\n      <p>Consultancy's been great but I'm properly burnt out. The constant travel, dealing w/ demanding clients, always having to be \"on\"... ugh. Plus Martinborough has vineyards nearby that could use my help. I'm not quitting, just relocating.</p>\n\n      <p>Been chasing the next big thing my whole adult life. Always bigger cities, cooler scenes. But this move feels different. When I walk thru the vineyards at sunset and smell the dirt and grapes, something in my chest just... unclenches? And the cafe dude knows my coffee order after 3 visits. Try that in Auckland.</p>\n\n      <p>Will miss Uber Eats at 2am when I'm hungover? Yup. But cities will always be there if this blows up in my face.</p>\n\n      <p>Got a cute little cottage right off the square. Can walk everywhere. Spend my mornings watching tourists wobble around on those ridiculous 4-person wine tour bikes. (They're even funnier after lunch stops, trust)</p>\n\n      <p>So here's to small town life, to switching \"always busy\" for \"occasionally bored,\" to being on first-name basis with everyone in town within a month. To Martinborough - the place I'm not running to escape something, just walking towards cuz it feels right. First time for everything, huh?</p>",
  "coverImage": "/images/blog/2025_01_05-leaving-auckland-for-small-town-life.jpg",
  "publishedAt": "2025-01-05T10:00:00Z",
  "category": "Personal",
  "location": "New Zealand",
  "featured": 0,
  "readTime": 5,
  "prevPostId": null,
  "nextPostId": null
}