{
  "id": 98,
  "title": "Trading City Lights for Vineyard Nights: My Move to Martinborough",
  "slug": "leaving-auckland-for-small-town-life",
  "excerpt": "After years in major cities, I'm making the leap to small-town life in wine country, trading convenience for connection and finding unexpected peace.",
  "content": "<p>I've shocked everyone again. Three years in Auckland, the longest I've stayed anywhere since leaving New York, and just when people thought I might actually put down roots... I'm moving to a town with one main street and more grapevines than people.</p>\n\n      <p>Martinborough wasn't even on my radar six months ago. I came here for a weekend wine tour with clients, expecting to enjoy the Pinot Noir and head straight back to city life. Instead, I found myself lingering, coming back on my days off, and eventually having that dangerous thought that changes everything: \"I could live here.\"</p>\n\n      <p>When I told my Auckland friends I was leaving, the reactions ranged from disbelief to something close to intervention. \"But what will you DO there?\" asked Mika, who thinks anything outside Auckland's city limits is basically wilderness. \"There's only like three restaurants!\" (There are seven, actually, I counted.) \"You'll be bored in a month!\"</p>\n\n      <p>Maybe they're right. Maybe this is a mid-life crisis hitting early. But after a decade in New York, then Sydney, then Auckland – I'm craving something else entirely.</p>\n\n      <p>The consultancy has been good to me, but after three years, I'm burned out from the constant travel, the client demands, the pressure to be constantly \"on.\" And Martinborough has several vineyards and neighboring towns that could use my expertise as a consultant.</p>\n\n      <p>I've spent so much of my adult life running to new places, always chasing something bigger or more exciting. But Martinborough? This one's different. I'm choosing it because of how it feels. Because when I walk through the vineyards at sunset and smell the earth and the grapes, something in me settles. Because the café owner already knows my coffee order after just three visits.</p>\n\n      <p>Will I miss having Uber Eats and 24-hour convenience stores? Probably, sometimes. But I've spent enough time in cities to know they'll always be there if I want to go back.</p>\n\n      <p>The cottage I'm renting has a small vineyard attached – just a few rows, nothing commercial. The owner said I can try making my own wine if I want. Me! Making wine! I know absolutely nothing about viticulture, but somehow that feels exactly right.</p>\n\n      <p>So here's to small towns, to slower living, to wine and cheese and scenery. Here's to Martinborough – the place I'm not running to, but walking towards, deliberately and hopefully. The place that, just maybe, might finally be home.</p>",
  "coverImage": "/images/blog/2025_01_05-leaving-auckland-for-small-town-life.jpg",
  "publishedAt": "2025-01-05T10:00:00Z",
  "category": "Personal",
  "location": "New Zealand",
  "featured": 0,
  "readTime": 5,
  "prevPostId": null,
  "nextPostId": null
}